HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMcds_reg.h
/**
 * \file IfxMcds_reg.h
 * \brief
 * \copyright Copyright (c) 2018 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC37x_TS_V2.6.0.R0
 * Specification: TC3xx Target Specification.V2.6.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxSfr_Mcds_Registers_Cfg Mcds address
 * \ingroup IfxSfr_Mcds_Registers
 * 
 * \defgroup IfxSfr_Mcds_Registers_Cfg_BaseAddress Base address
 * \ingroup IfxSfr_Mcds_Registers_Cfg
 *
 * \defgroup IfxSfr_Mcds_Registers_Cfg_Mcds 2-MCDS
 * \ingroup IfxSfr_Mcds_Registers_Cfg
 *
 *
 */
#ifndef IFXMCDS_REG_H
#define IFXMCDS_REG_H 1
/******************************************************************************/
#include "IfxMcds_regdef.h"
/******************************************************************************/

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Mcds_Registers_Cfg_BaseAddress
 * \{  */

/** \brief MCDS object */
#define MODULE_MCDS /*lint --e(923, 9078)*/ ((*(Ifx_MCDS*)0xFA010000u))
/** \}  */


/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_Registers_Cfg_Mcds
 * \{  */
/** \brief 0, Clock Control Register */
#define MCDS_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_CLC*)0xFA010000u)

/** \brief 4, OCDS Control and Status */
#define MCDS_OCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_OCS*)0xFA010004u)

/** \brief 8, Module Identification Register */
#define MCDS_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_ID*)0xFA010008u)

/** \brief 10, MCDS Control Register */
#define MCDS_CT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_CT*)0xFA010010u)

/** \brief 14, MCDS Signal Source Control */
#define MCDS_MUX /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MUX*)0xFA010014u)

/** \brief 18, Session ID Low Register */
#define MCDS_SESSIDL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SESSIDL*)0xFA010018u)

/** \brief 1C, Session ID High Register */
#define MCDS_SESSIDH /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SESSIDH*)0xFA01001Cu)

/** \brief 20, MCDS_TC Signal Source Control */
#define MCDS_MUX_TC_RC /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MUX_TC_RC*)0xFA010020u)

/** \brief F8, Access Enable Register 1 */
#define MCDS_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_ACCEN1*)0xFA0100F8u)

/** \brief FC, Access Enable Register 0 */
#define MCDS_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_ACCEN0*)0xFA0100FCu)

/** \brief 200, Trace Buffer Write Pointer */
#define MCDS_FIFONOW /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_FIFONOW*)0xFA010200u)

/** \brief 204, Trace Buffer Bottom Register */
#define MCDS_FIFOBOT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_FIFOBOT*)0xFA010204u)

/** \brief 208, Trace Buffer PRE/POST Register */
#define MCDS_FIFOPRE /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_FIFOPRE*)0xFA010208u)

/** \brief 20C, Trace Buffer Top Register */
#define MCDS_FIFOTOP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_FIFOTOP*)0xFA01020Cu)

/** \brief 210, Trace Buffer Control Register */
#define MCDS_FIFOCTL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_FIFOCTL*)0xFA010210u)

/** \brief 214, Trace Buffer Comparator Register */
#define MCDS_FIFOWARN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_FIFOWARN*)0xFA010214u)

/** \brief 218, Trace Buffer Comparator Register */
#define MCDS_FIFOWARN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_FIFOWARN*)0xFA010218u)

/** \brief 21C, FIFO Overflow Counter Register */
#define MCDS_FIFOOVRCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_FIFOOVRCNT*)0xFA01021Cu)

/** \brief 220, Trace Buffer Captured Write Pointer */
#define MCDS_FIFONTNOW /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_FIFONTNOW*)0xFA010220u)

/** \brief 400, Clock Counter Register */
#define MCDS_TSUREFCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TSUREFCNT*)0xFA010400u)

/** \brief 404, Clock Prescaler Register */
#define MCDS_TSUPRSCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TSUPRSCL*)0xFA010404u)

/** \brief 408, Clock Counter Register */
#define MCDS_TSUEMUCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TSUEMUCNT*)0xFA010408u)

/** \brief 800, Event Definition Register 0 */
#define MCDS_MCXEVT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXEVT*)0xFA010800u)

/** \brief 804, Event Definition Register 1 */
#define MCDS_MCXEVT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXEVT*)0xFA010804u)

/** \brief 808, Event Definition Register 2 */
#define MCDS_MCXEVT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXEVT*)0xFA010808u)

/** \brief 80C, Event Definition Register 3 */
#define MCDS_MCXEVT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXEVT*)0xFA01080Cu)

/** \brief 810, Event Definition Register 4 */
#define MCDS_MCXEVT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXEVT*)0xFA010810u)

/** \brief 814, Event Definition Register 5 */
#define MCDS_MCXEVT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXEVT*)0xFA010814u)

/** \brief 818, Event Definition Register 6 */
#define MCDS_MCXEVT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXEVT*)0xFA010818u)

/** \brief 81C, Event Definition Register 7 */
#define MCDS_MCXEVT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXEVT*)0xFA01081Cu)

