HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMcds_reg.h
/** \brief 9B4, Action Definition Register 77 */
#define MCDS_MCXACT77 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA0109B4u)

/** \brief 9B8, Action Definition Register 78 */
#define MCDS_MCXACT78 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA0109B8u)

/** \brief 9BC, Action Definition Register 79 */
#define MCDS_MCXACT79 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA0109BCu)

/** \brief 9C0, Action Definition Register 80 */
#define MCDS_MCXACT80 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA0109C0u)

/** \brief A00, Counter Control Register */
#define MCDS_MCX0_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010A00u)
/** Alias (User Manual Name) for MCDS_MCX0_CCL.
* To use register names with standard convension, please use MCDS_MCX0_CCL.
*/
#define MCDS_MCXCCL0 (MCDS_MCX0_CCL)

/** \brief A04, Counter Limit Register */
#define MCDS_MCX0_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010A04u)
/** Alias (User Manual Name) for MCDS_MCX0_LMT.
* To use register names with standard convension, please use MCDS_MCX0_LMT.
*/
#define MCDS_MCXLMT0 (MCDS_MCX0_LMT)

/** \brief A08, Current Count Register */
#define MCDS_MCX0_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010A08u)
/** Alias (User Manual Name) for MCDS_MCX0_CNT.
* To use register names with standard convension, please use MCDS_MCX0_CNT.
*/
#define MCDS_MCXCNT0 (MCDS_MCX0_CNT)

/** \brief A10, Counter Control Register */
#define MCDS_MCX1_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010A10u)
/** Alias (User Manual Name) for MCDS_MCX1_CCL.
* To use register names with standard convension, please use MCDS_MCX1_CCL.
*/
#define MCDS_MCXCCL1 (MCDS_MCX1_CCL)

/** \brief A14, Counter Limit Register */
#define MCDS_MCX1_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010A14u)
/** Alias (User Manual Name) for MCDS_MCX1_LMT.
* To use register names with standard convension, please use MCDS_MCX1_LMT.
*/
#define MCDS_MCXLMT1 (MCDS_MCX1_LMT)

/** \brief A18, Current Count Register */
#define MCDS_MCX1_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010A18u)
/** Alias (User Manual Name) for MCDS_MCX1_CNT.
* To use register names with standard convension, please use MCDS_MCX1_CNT.
*/
#define MCDS_MCXCNT1 (MCDS_MCX1_CNT)

/** \brief A20, Counter Control Register */
#define MCDS_MCX2_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010A20u)
/** Alias (User Manual Name) for MCDS_MCX2_CCL.
* To use register names with standard convension, please use MCDS_MCX2_CCL.
*/
#define MCDS_MCXCCL2 (MCDS_MCX2_CCL)

/** \brief A24, Counter Limit Register */
#define MCDS_MCX2_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010A24u)
/** Alias (User Manual Name) for MCDS_MCX2_LMT.
* To use register names with standard convension, please use MCDS_MCX2_LMT.
*/
#define MCDS_MCXLMT2 (MCDS_MCX2_LMT)

/** \brief A28, Current Count Register */
#define MCDS_MCX2_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010A28u)
/** Alias (User Manual Name) for MCDS_MCX2_CNT.
* To use register names with standard convension, please use MCDS_MCX2_CNT.
*/
#define MCDS_MCXCNT2 (MCDS_MCX2_CNT)

/** \brief A30, Counter Control Register */
#define MCDS_MCX3_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010A30u)
/** Alias (User Manual Name) for MCDS_MCX3_CCL.
* To use register names with standard convension, please use MCDS_MCX3_CCL.
*/
#define MCDS_MCXCCL3 (MCDS_MCX3_CCL)

/** \brief A34, Counter Limit Register */
#define MCDS_MCX3_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010A34u)
/** Alias (User Manual Name) for MCDS_MCX3_LMT.
* To use register names with standard convension, please use MCDS_MCX3_LMT.
*/
#define MCDS_MCXLMT3 (MCDS_MCX3_LMT)

/** \brief A38, Current Count Register */
#define MCDS_MCX3_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010A38u)
/** Alias (User Manual Name) for MCDS_MCX3_CNT.
* To use register names with standard convension, please use MCDS_MCX3_CNT.
*/
#define MCDS_MCXCNT3 (MCDS_MCX3_CNT)

/** \brief A40, Counter Control Register */
#define MCDS_MCX4_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010A40u)
/** Alias (User Manual Name) for MCDS_MCX4_CCL.
* To use register names with standard convension, please use MCDS_MCX4_CCL.
*/
#define MCDS_MCXCCL4 (MCDS_MCX4_CCL)

/** \brief A44, Counter Limit Register */
#define MCDS_MCX4_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010A44u)
/** Alias (User Manual Name) for MCDS_MCX4_LMT.
* To use register names with standard convension, please use MCDS_MCX4_LMT.
*/
#define MCDS_MCXLMT4 (MCDS_MCX4_LMT)

/** \brief A48, Current Count Register */
#define MCDS_MCX4_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010A48u)
/** Alias (User Manual Name) for MCDS_MCX4_CNT.
* To use register names with standard convension, please use MCDS_MCX4_CNT.
*/
#define MCDS_MCXCNT4 (MCDS_MCX4_CNT)

/** \brief A50, Counter Control Register */
#define MCDS_MCX5_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010A50u)
/** Alias (User Manual Name) for MCDS_MCX5_CCL.
* To use register names with standard convension, please use MCDS_MCX5_CCL.
*/
#define MCDS_MCXCCL5 (MCDS_MCX5_CCL)

/** \brief A54, Counter Limit Register */
#define MCDS_MCX5_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010A54u)
/** Alias (User Manual Name) for MCDS_MCX5_LMT.
* To use register names with standard convension, please use MCDS_MCX5_LMT.
*/
#define MCDS_MCXLMT5 (MCDS_MCX5_LMT)

/** \brief A58, Current Count Register */
#define MCDS_MCX5_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010A58u)
/** Alias (User Manual Name) for MCDS_MCX5_CNT.
* To use register names with standard convension, please use MCDS_MCX5_CNT.
*/
#define MCDS_MCXCNT5 (MCDS_MCX5_CNT)

/** \brief A60, Counter Control Register */
#define MCDS_MCX6_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010A60u)
/** Alias (User Manual Name) for MCDS_MCX6_CCL.
* To use register names with standard convension, please use MCDS_MCX6_CCL.
*/
#define MCDS_MCXCCL6 (MCDS_MCX6_CCL)

