HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMcds_reg.h
/** \brief A64, Counter Limit Register */
#define MCDS_MCX6_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010A64u)
/** Alias (User Manual Name) for MCDS_MCX6_LMT.
* To use register names with standard convension, please use MCDS_MCX6_LMT.
*/
#define MCDS_MCXLMT6 (MCDS_MCX6_LMT)

/** \brief A68, Current Count Register */
#define MCDS_MCX6_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010A68u)
/** Alias (User Manual Name) for MCDS_MCX6_CNT.
* To use register names with standard convension, please use MCDS_MCX6_CNT.
*/
#define MCDS_MCXCNT6 (MCDS_MCX6_CNT)

/** \brief A70, Counter Control Register */
#define MCDS_MCX7_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010A70u)
/** Alias (User Manual Name) for MCDS_MCX7_CCL.
* To use register names with standard convension, please use MCDS_MCX7_CCL.
*/
#define MCDS_MCXCCL7 (MCDS_MCX7_CCL)

/** \brief A74, Counter Limit Register */
#define MCDS_MCX7_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010A74u)
/** Alias (User Manual Name) for MCDS_MCX7_LMT.
* To use register names with standard convension, please use MCDS_MCX7_LMT.
*/
#define MCDS_MCXLMT7 (MCDS_MCX7_LMT)

/** \brief A78, Current Count Register */
#define MCDS_MCX7_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010A78u)
/** Alias (User Manual Name) for MCDS_MCX7_CNT.
* To use register names with standard convension, please use MCDS_MCX7_CNT.
*/
#define MCDS_MCXCNT7 (MCDS_MCX7_CNT)

/** \brief A80, Counter Control Register */
#define MCDS_MCX8_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010A80u)
/** Alias (User Manual Name) for MCDS_MCX8_CCL.
* To use register names with standard convension, please use MCDS_MCX8_CCL.
*/
#define MCDS_MCXCCL8 (MCDS_MCX8_CCL)

/** \brief A84, Counter Limit Register */
#define MCDS_MCX8_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010A84u)
/** Alias (User Manual Name) for MCDS_MCX8_LMT.
* To use register names with standard convension, please use MCDS_MCX8_LMT.
*/
#define MCDS_MCXLMT8 (MCDS_MCX8_LMT)

/** \brief A88, Current Count Register */
#define MCDS_MCX8_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010A88u)
/** Alias (User Manual Name) for MCDS_MCX8_CNT.
* To use register names with standard convension, please use MCDS_MCX8_CNT.
*/
#define MCDS_MCXCNT8 (MCDS_MCX8_CNT)

/** \brief A90, Counter Control Register */
#define MCDS_MCX9_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010A90u)
/** Alias (User Manual Name) for MCDS_MCX9_CCL.
* To use register names with standard convension, please use MCDS_MCX9_CCL.
*/
#define MCDS_MCXCCL9 (MCDS_MCX9_CCL)

/** \brief A94, Counter Limit Register */
#define MCDS_MCX9_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010A94u)
/** Alias (User Manual Name) for MCDS_MCX9_LMT.
* To use register names with standard convension, please use MCDS_MCX9_LMT.
*/
#define MCDS_MCXLMT9 (MCDS_MCX9_LMT)

/** \brief A98, Current Count Register */
#define MCDS_MCX9_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010A98u)
/** Alias (User Manual Name) for MCDS_MCX9_CNT.
* To use register names with standard convension, please use MCDS_MCX9_CNT.
*/
#define MCDS_MCXCNT9 (MCDS_MCX9_CNT)

/** \brief AA0, Counter Control Register */
#define MCDS_MCX10_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010AA0u)
/** Alias (User Manual Name) for MCDS_MCX10_CCL.
* To use register names with standard convension, please use MCDS_MCX10_CCL.
*/
#define MCDS_MCXCCL10 (MCDS_MCX10_CCL)

/** \brief AA4, Counter Limit Register */
#define MCDS_MCX10_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010AA4u)
/** Alias (User Manual Name) for MCDS_MCX10_LMT.
* To use register names with standard convension, please use MCDS_MCX10_LMT.
*/
#define MCDS_MCXLMT10 (MCDS_MCX10_LMT)

/** \brief AA8, Current Count Register */
#define MCDS_MCX10_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010AA8u)
/** Alias (User Manual Name) for MCDS_MCX10_CNT.
* To use register names with standard convension, please use MCDS_MCX10_CNT.
*/
#define MCDS_MCXCNT10 (MCDS_MCX10_CNT)

/** \brief AB0, Counter Control Register */
#define MCDS_MCX11_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010AB0u)
/** Alias (User Manual Name) for MCDS_MCX11_CCL.
* To use register names with standard convension, please use MCDS_MCX11_CCL.
*/
#define MCDS_MCXCCL11 (MCDS_MCX11_CCL)

/** \brief AB4, Counter Limit Register */
#define MCDS_MCX11_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010AB4u)
/** Alias (User Manual Name) for MCDS_MCX11_LMT.
* To use register names with standard convension, please use MCDS_MCX11_LMT.
*/
#define MCDS_MCXLMT11 (MCDS_MCX11_LMT)

/** \brief AB8, Current Count Register */
#define MCDS_MCX11_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010AB8u)
/** Alias (User Manual Name) for MCDS_MCX11_CNT.
* To use register names with standard convension, please use MCDS_MCX11_CNT.
*/
#define MCDS_MCXCNT11 (MCDS_MCX11_CNT)

/** \brief AC0, Counter Control Register */
#define MCDS_MCX12_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010AC0u)
/** Alias (User Manual Name) for MCDS_MCX12_CCL.
* To use register names with standard convension, please use MCDS_MCX12_CCL.
*/
#define MCDS_MCXCCL12 (MCDS_MCX12_CCL)

/** \brief AC4, Counter Limit Register */
#define MCDS_MCX12_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010AC4u)
/** Alias (User Manual Name) for MCDS_MCX12_LMT.
* To use register names with standard convension, please use MCDS_MCX12_LMT.
*/
#define MCDS_MCXLMT12 (MCDS_MCX12_LMT)

/** \brief AC8, Current Count Register */
#define MCDS_MCX12_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010AC8u)
/** Alias (User Manual Name) for MCDS_MCX12_CNT.
* To use register names with standard convension, please use MCDS_MCX12_CNT.
*/
#define MCDS_MCXCNT12 (MCDS_MCX12_CNT)

/** \brief AD0, Counter Control Register */
#define MCDS_MCX13_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010AD0u)
/** Alias (User Manual Name) for MCDS_MCX13_CCL.
* To use register names with standard convension, please use MCDS_MCX13_CCL.
*/
#define MCDS_MCXCCL13 (MCDS_MCX13_CCL)

/** \brief AD4, Counter Limit Register */
#define MCDS_MCX13_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010AD4u)
/** Alias (User Manual Name) for MCDS_MCX13_LMT.
* To use register names with standard convension, please use MCDS_MCX13_LMT.
*/
#define MCDS_MCXLMT13 (MCDS_MCX13_LMT)

/** \brief AD8, Current Count Register */
#define MCDS_MCX13_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010AD8u)
/** Alias (User Manual Name) for MCDS_MCX13_CNT.
* To use register names with standard convension, please use MCDS_MCX13_CNT.
*/
#define MCDS_MCXCNT13 (MCDS_MCX13_CNT)

/** \brief AE0, Counter Control Register */
#define MCDS_MCX14_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010AE0u)
/** Alias (User Manual Name) for MCDS_MCX14_CCL.
* To use register names with standard convension, please use MCDS_MCX14_CCL.
*/
#define MCDS_MCXCCL14 (MCDS_MCX14_CCL)

/** \brief AE4, Counter Limit Register */
#define MCDS_MCX14_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010AE4u)
/** Alias (User Manual Name) for MCDS_MCX14_LMT.
* To use register names with standard convension, please use MCDS_MCX14_LMT.
*/
#define MCDS_MCXLMT14 (MCDS_MCX14_LMT)

/** \brief AE8, Current Count Register */
#define MCDS_MCX14_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010AE8u)
/** Alias (User Manual Name) for MCDS_MCX14_CNT.
* To use register names with standard convension, please use MCDS_MCX14_CNT.
*/
#define MCDS_MCXCNT14 (MCDS_MCX14_CNT)

/** \brief AF0, Counter Control Register */
#define MCDS_MCX15_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010AF0u)
/** Alias (User Manual Name) for MCDS_MCX15_CCL.
* To use register names with standard convension, please use MCDS_MCX15_CCL.
*/
#define MCDS_MCXCCL15 (MCDS_MCX15_CCL)

/** \brief AF4, Counter Limit Register */
#define MCDS_MCX15_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010AF4u)
/** Alias (User Manual Name) for MCDS_MCX15_LMT.
* To use register names with standard convension, please use MCDS_MCX15_LMT.
*/
#define MCDS_MCXLMT15 (MCDS_MCX15_LMT)

/** \brief AF8, Current Count Register */
#define MCDS_MCX15_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010AF8u)
/** Alias (User Manual Name) for MCDS_MCX15_CNT.
* To use register names with standard convension, please use MCDS_MCX15_CNT.
*/
#define MCDS_MCXCNT15 (MCDS_MCX15_CNT)

