HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMcds_reg.h
/** \brief B00, Counter Control Register */
#define MCDS_MCX16_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010B00u)
/** Alias (User Manual Name) for MCDS_MCX16_CCL.
* To use register names with standard convension, please use MCDS_MCX16_CCL.
*/
#define MCDS_MCXCCL16 (MCDS_MCX16_CCL)

/** \brief B04, Counter Limit Register */
#define MCDS_MCX16_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010B04u)
/** Alias (User Manual Name) for MCDS_MCX16_LMT.
* To use register names with standard convension, please use MCDS_MCX16_LMT.
*/
#define MCDS_MCXLMT16 (MCDS_MCX16_LMT)

/** \brief B08, Current Count Register */
#define MCDS_MCX16_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010B08u)
/** Alias (User Manual Name) for MCDS_MCX16_CNT.
* To use register names with standard convension, please use MCDS_MCX16_CNT.
*/
#define MCDS_MCXCNT16 (MCDS_MCX16_CNT)

/** \brief B10, Counter Control Register */
#define MCDS_MCX17_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010B10u)
/** Alias (User Manual Name) for MCDS_MCX17_CCL.
* To use register names with standard convension, please use MCDS_MCX17_CCL.
*/
#define MCDS_MCXCCL17 (MCDS_MCX17_CCL)

/** \brief B14, Counter Limit Register */
#define MCDS_MCX17_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010B14u)
/** Alias (User Manual Name) for MCDS_MCX17_LMT.
* To use register names with standard convension, please use MCDS_MCX17_LMT.
*/
#define MCDS_MCXLMT17 (MCDS_MCX17_LMT)

/** \brief B18, Current Count Register */
#define MCDS_MCX17_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010B18u)
/** Alias (User Manual Name) for MCDS_MCX17_CNT.
* To use register names with standard convension, please use MCDS_MCX17_CNT.
*/
#define MCDS_MCXCNT17 (MCDS_MCX17_CNT)

/** \brief B20, Counter Control Register */
#define MCDS_MCX18_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010B20u)
/** Alias (User Manual Name) for MCDS_MCX18_CCL.
* To use register names with standard convension, please use MCDS_MCX18_CCL.
*/
#define MCDS_MCXCCL18 (MCDS_MCX18_CCL)

/** \brief B24, Counter Limit Register */
#define MCDS_MCX18_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010B24u)
/** Alias (User Manual Name) for MCDS_MCX18_LMT.
* To use register names with standard convension, please use MCDS_MCX18_LMT.
*/
#define MCDS_MCXLMT18 (MCDS_MCX18_LMT)

/** \brief B28, Current Count Register */
#define MCDS_MCX18_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010B28u)
/** Alias (User Manual Name) for MCDS_MCX18_CNT.
* To use register names with standard convension, please use MCDS_MCX18_CNT.
*/
#define MCDS_MCXCNT18 (MCDS_MCX18_CNT)

/** \brief B30, Counter Control Register */
#define MCDS_MCX19_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010B30u)
/** Alias (User Manual Name) for MCDS_MCX19_CCL.
* To use register names with standard convension, please use MCDS_MCX19_CCL.
*/
#define MCDS_MCXCCL19 (MCDS_MCX19_CCL)

/** \brief B34, Counter Limit Register */
#define MCDS_MCX19_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010B34u)
/** Alias (User Manual Name) for MCDS_MCX19_LMT.
* To use register names with standard convension, please use MCDS_MCX19_LMT.
*/
#define MCDS_MCXLMT19 (MCDS_MCX19_LMT)

/** \brief B38, Current Count Register */
#define MCDS_MCX19_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010B38u)
/** Alias (User Manual Name) for MCDS_MCX19_CNT.
* To use register names with standard convension, please use MCDS_MCX19_CNT.
*/
#define MCDS_MCXCNT19 (MCDS_MCX19_CNT)

/** \brief B40, Counter Control Register */
#define MCDS_MCX20_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010B40u)
/** Alias (User Manual Name) for MCDS_MCX20_CCL.
* To use register names with standard convension, please use MCDS_MCX20_CCL.
*/
#define MCDS_MCXCCL20 (MCDS_MCX20_CCL)

/** \brief B44, Counter Limit Register */
#define MCDS_MCX20_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010B44u)
/** Alias (User Manual Name) for MCDS_MCX20_LMT.
* To use register names with standard convension, please use MCDS_MCX20_LMT.
*/
#define MCDS_MCXLMT20 (MCDS_MCX20_LMT)

/** \brief B48, Current Count Register */
#define MCDS_MCX20_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010B48u)
/** Alias (User Manual Name) for MCDS_MCX20_CNT.
* To use register names with standard convension, please use MCDS_MCX20_CNT.
*/
#define MCDS_MCXCNT20 (MCDS_MCX20_CNT)

/** \brief B50, Counter Control Register */
#define MCDS_MCX21_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010B50u)
/** Alias (User Manual Name) for MCDS_MCX21_CCL.
* To use register names with standard convension, please use MCDS_MCX21_CCL.
*/
#define MCDS_MCXCCL21 (MCDS_MCX21_CCL)

/** \brief B54, Counter Limit Register */
#define MCDS_MCX21_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010B54u)
/** Alias (User Manual Name) for MCDS_MCX21_LMT.
* To use register names with standard convension, please use MCDS_MCX21_LMT.
*/
#define MCDS_MCXLMT21 (MCDS_MCX21_LMT)

/** \brief B58, Current Count Register */
#define MCDS_MCX21_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010B58u)
/** Alias (User Manual Name) for MCDS_MCX21_CNT.
* To use register names with standard convension, please use MCDS_MCX21_CNT.
*/
#define MCDS_MCXCNT21 (MCDS_MCX21_CNT)

/** \brief B60, Counter Control Register */
#define MCDS_MCX22_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010B60u)
/** Alias (User Manual Name) for MCDS_MCX22_CCL.
* To use register names with standard convension, please use MCDS_MCX22_CCL.
*/
#define MCDS_MCXCCL22 (MCDS_MCX22_CCL)

/** \brief B64, Counter Limit Register */
#define MCDS_MCX22_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010B64u)
/** Alias (User Manual Name) for MCDS_MCX22_LMT.
* To use register names with standard convension, please use MCDS_MCX22_LMT.
*/
#define MCDS_MCXLMT22 (MCDS_MCX22_LMT)

/** \brief B68, Current Count Register */
#define MCDS_MCX22_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010B68u)
/** Alias (User Manual Name) for MCDS_MCX22_CNT.
* To use register names with standard convension, please use MCDS_MCX22_CNT.
*/
#define MCDS_MCXCNT22 (MCDS_MCX22_CNT)

/** \brief B70, Counter Control Register */
#define MCDS_MCX23_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010B70u)
/** Alias (User Manual Name) for MCDS_MCX23_CCL.
* To use register names with standard convension, please use MCDS_MCX23_CCL.
*/
#define MCDS_MCXCCL23 (MCDS_MCX23_CCL)

