HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMcds_reg.h
/** \brief B74, Counter Limit Register */
#define MCDS_MCX23_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010B74u)
/** Alias (User Manual Name) for MCDS_MCX23_LMT.
* To use register names with standard convension, please use MCDS_MCX23_LMT.
*/
#define MCDS_MCXLMT23 (MCDS_MCX23_LMT)

/** \brief B78, Current Count Register */
#define MCDS_MCX23_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010B78u)
/** Alias (User Manual Name) for MCDS_MCX23_CNT.
* To use register names with standard convension, please use MCDS_MCX23_CNT.
*/
#define MCDS_MCXCNT23 (MCDS_MCX23_CNT)

/** \brief B80, Counter Control Register */
#define MCDS_MCX24_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010B80u)
/** Alias (User Manual Name) for MCDS_MCX24_CCL.
* To use register names with standard convension, please use MCDS_MCX24_CCL.
*/
#define MCDS_MCXCCL24 (MCDS_MCX24_CCL)

/** \brief B84, Counter Limit Register */
#define MCDS_MCX24_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010B84u)
/** Alias (User Manual Name) for MCDS_MCX24_LMT.
* To use register names with standard convension, please use MCDS_MCX24_LMT.
*/
#define MCDS_MCXLMT24 (MCDS_MCX24_LMT)

/** \brief B88, Current Count Register */
#define MCDS_MCX24_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010B88u)
/** Alias (User Manual Name) for MCDS_MCX24_CNT.
* To use register names with standard convension, please use MCDS_MCX24_CNT.
*/
#define MCDS_MCXCNT24 (MCDS_MCX24_CNT)

/** \brief B90, Counter Control Register */
#define MCDS_MCX25_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010B90u)
/** Alias (User Manual Name) for MCDS_MCX25_CCL.
* To use register names with standard convension, please use MCDS_MCX25_CCL.
*/
#define MCDS_MCXCCL25 (MCDS_MCX25_CCL)

/** \brief B94, Counter Limit Register */
#define MCDS_MCX25_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010B94u)
/** Alias (User Manual Name) for MCDS_MCX25_LMT.
* To use register names with standard convension, please use MCDS_MCX25_LMT.
*/
#define MCDS_MCXLMT25 (MCDS_MCX25_LMT)

/** \brief B98, Current Count Register */
#define MCDS_MCX25_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010B98u)
/** Alias (User Manual Name) for MCDS_MCX25_CNT.
* To use register names with standard convension, please use MCDS_MCX25_CNT.
*/
#define MCDS_MCXCNT25 (MCDS_MCX25_CNT)

/** \brief BA0, Counter Control Register */
#define MCDS_MCX26_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010BA0u)
/** Alias (User Manual Name) for MCDS_MCX26_CCL.
* To use register names with standard convension, please use MCDS_MCX26_CCL.
*/
#define MCDS_MCXCCL26 (MCDS_MCX26_CCL)

/** \brief BA4, Counter Limit Register */
#define MCDS_MCX26_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010BA4u)
/** Alias (User Manual Name) for MCDS_MCX26_LMT.
* To use register names with standard convension, please use MCDS_MCX26_LMT.
*/
#define MCDS_MCXLMT26 (MCDS_MCX26_LMT)

/** \brief BA8, Current Count Register */
#define MCDS_MCX26_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010BA8u)
/** Alias (User Manual Name) for MCDS_MCX26_CNT.
* To use register names with standard convension, please use MCDS_MCX26_CNT.
*/
#define MCDS_MCXCNT26 (MCDS_MCX26_CNT)

/** \brief BB0, Counter Control Register */
#define MCDS_MCX27_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010BB0u)
/** Alias (User Manual Name) for MCDS_MCX27_CCL.
* To use register names with standard convension, please use MCDS_MCX27_CCL.
*/
#define MCDS_MCXCCL27 (MCDS_MCX27_CCL)

/** \brief BB4, Counter Limit Register */
#define MCDS_MCX27_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010BB4u)
/** Alias (User Manual Name) for MCDS_MCX27_LMT.
* To use register names with standard convension, please use MCDS_MCX27_LMT.
*/
#define MCDS_MCXLMT27 (MCDS_MCX27_LMT)

/** \brief BB8, Current Count Register */
#define MCDS_MCX27_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010BB8u)
/** Alias (User Manual Name) for MCDS_MCX27_CNT.
* To use register names with standard convension, please use MCDS_MCX27_CNT.
*/
#define MCDS_MCXCNT27 (MCDS_MCX27_CNT)

/** \brief BC0, Counter Control Register */
#define MCDS_MCX28_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010BC0u)
/** Alias (User Manual Name) for MCDS_MCX28_CCL.
* To use register names with standard convension, please use MCDS_MCX28_CCL.
*/
#define MCDS_MCXCCL28 (MCDS_MCX28_CCL)

/** \brief BC4, Counter Limit Register */
#define MCDS_MCX28_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010BC4u)
/** Alias (User Manual Name) for MCDS_MCX28_LMT.
* To use register names with standard convension, please use MCDS_MCX28_LMT.
*/
#define MCDS_MCXLMT28 (MCDS_MCX28_LMT)

/** \brief BC8, Current Count Register */
#define MCDS_MCX28_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010BC8u)
/** Alias (User Manual Name) for MCDS_MCX28_CNT.
* To use register names with standard convension, please use MCDS_MCX28_CNT.
*/
#define MCDS_MCXCNT28 (MCDS_MCX28_CNT)

/** \brief BD0, Counter Control Register */
#define MCDS_MCX29_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010BD0u)
/** Alias (User Manual Name) for MCDS_MCX29_CCL.
* To use register names with standard convension, please use MCDS_MCX29_CCL.
*/
#define MCDS_MCXCCL29 (MCDS_MCX29_CCL)

/** \brief BD4, Counter Limit Register */
#define MCDS_MCX29_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010BD4u)
/** Alias (User Manual Name) for MCDS_MCX29_LMT.
* To use register names with standard convension, please use MCDS_MCX29_LMT.
*/
#define MCDS_MCXLMT29 (MCDS_MCX29_LMT)

/** \brief BD8, Current Count Register */
#define MCDS_MCX29_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010BD8u)
/** Alias (User Manual Name) for MCDS_MCX29_CNT.
* To use register names with standard convension, please use MCDS_MCX29_CNT.
*/
#define MCDS_MCXCNT29 (MCDS_MCX29_CNT)

/** \brief BE0, Counter Control Register */
#define MCDS_MCX30_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010BE0u)
/** Alias (User Manual Name) for MCDS_MCX30_CCL.
* To use register names with standard convension, please use MCDS_MCX30_CCL.
*/
#define MCDS_MCXCCL30 (MCDS_MCX30_CCL)

/** \brief BE4, Counter Limit Register */
#define MCDS_MCX30_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010BE4u)
/** Alias (User Manual Name) for MCDS_MCX30_LMT.
* To use register names with standard convension, please use MCDS_MCX30_LMT.
*/
#define MCDS_MCXLMT30 (MCDS_MCX30_LMT)

/** \brief BE8, Current Count Register */
#define MCDS_MCX30_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010BE8u)
/** Alias (User Manual Name) for MCDS_MCX30_CNT.
* To use register names with standard convension, please use MCDS_MCX30_CNT.
*/
#define MCDS_MCXCNT30 (MCDS_MCX30_CNT)

/** \brief BF0, Counter Control Register */
#define MCDS_MCX31_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010BF0u)
/** Alias (User Manual Name) for MCDS_MCX31_CCL.
* To use register names with standard convension, please use MCDS_MCX31_CCL.
*/
#define MCDS_MCXCCL31 (MCDS_MCX31_CCL)

/** \brief BF4, Counter Limit Register */
#define MCDS_MCX31_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010BF4u)
/** Alias (User Manual Name) for MCDS_MCX31_LMT.
* To use register names with standard convension, please use MCDS_MCX31_LMT.
*/
#define MCDS_MCXLMT31 (MCDS_MCX31_LMT)

/** \brief BF8, Current Count Register */
#define MCDS_MCX31_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010BF8u)
/** Alias (User Manual Name) for MCDS_MCX31_CNT.
* To use register names with standard convension, please use MCDS_MCX31_CNT.
*/
#define MCDS_MCXCNT31 (MCDS_MCX31_CNT)

