HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMcds_reg.h
/** \brief C00, Performance Counter Configuration Register */
#define MCDS_MCXPERFCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXPERFCFG*)0xFA010C00u)

/** \brief 2000, Debug Status Register */
#define MCDS_TCXDCSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXDCSTS*)0xFA012000u)

/** \brief 2004, Current Process ID */
#define MCDS_TCXCID /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXCID*)0xFA012004u)

/** \brief 2008, Current Instruction Pointer */
#define MCDS_TCXCIP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXCIP*)0xFA012008u)

/** \brief 200C, Compact Function Trace Register */
#define MCDS_TCXCFT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXCFT*)0xFA01200Cu)

/** \brief 2200, Lookup Table Data Register */
#define MCDS_TCXPALLUTD /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXPALLUTD*)0xFA012200u)

/** \brief 2204, Lookup Table Address Register */
#define MCDS_TCXPALLUTA /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXPALLUTA*)0xFA012204u)

/** \brief 2210, Lookup Table Base Register */
#define MCDS_TCXPAL0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXPAL_BND*)0xFA012210u)
/** Alias (User Manual Name) for MCDS_TCXPAL0_BND.
* To use register names with standard convension, please use MCDS_TCXPAL0_BND.
*/
#define MCDS_TCXPALBND0 (MCDS_TCXPAL0_BND)

/** \brief 2214, Lookup Table Range Register */
#define MCDS_TCXPAL0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXPAL_RNG*)0xFA012214u)
/** Alias (User Manual Name) for MCDS_TCXPAL0_RNG.
* To use register names with standard convension, please use MCDS_TCXPAL0_RNG.
*/
#define MCDS_TCXPALRNG0 (MCDS_TCXPAL0_RNG)

/** \brief 2218, Lookup Table Mapping Register */
#define MCDS_TCXPAL0_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXPAL_MAP*)0xFA012218u)
/** Alias (User Manual Name) for MCDS_TCXPAL0_MAP.
* To use register names with standard convension, please use MCDS_TCXPAL0_MAP.
*/
#define MCDS_TCXPALMAP0 (MCDS_TCXPAL0_MAP)

/** \brief 2220, Lookup Table Base Register */
#define MCDS_TCXPAL1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXPAL_BND*)0xFA012220u)
/** Alias (User Manual Name) for MCDS_TCXPAL1_BND.
* To use register names with standard convension, please use MCDS_TCXPAL1_BND.
*/
#define MCDS_TCXPALBND1 (MCDS_TCXPAL1_BND)

/** \brief 2224, Lookup Table Range Register */
#define MCDS_TCXPAL1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXPAL_RNG*)0xFA012224u)
/** Alias (User Manual Name) for MCDS_TCXPAL1_RNG.
* To use register names with standard convension, please use MCDS_TCXPAL1_RNG.
*/
#define MCDS_TCXPALRNG1 (MCDS_TCXPAL1_RNG)

/** \brief 2228, Lookup Table Mapping Register */
#define MCDS_TCXPAL1_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXPAL_MAP*)0xFA012228u)
/** Alias (User Manual Name) for MCDS_TCXPAL1_MAP.
* To use register names with standard convension, please use MCDS_TCXPAL1_MAP.
*/
#define MCDS_TCXPALMAP1 (MCDS_TCXPAL1_MAP)

/** \brief 2230, Lookup Table Base Register */
#define MCDS_TCXPAL2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXPAL_BND*)0xFA012230u)
/** Alias (User Manual Name) for MCDS_TCXPAL2_BND.
* To use register names with standard convension, please use MCDS_TCXPAL2_BND.
*/
#define MCDS_TCXPALBND2 (MCDS_TCXPAL2_BND)

/** \brief 2234, Lookup Table Range Register */
#define MCDS_TCXPAL2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXPAL_RNG*)0xFA012234u)
/** Alias (User Manual Name) for MCDS_TCXPAL2_RNG.
* To use register names with standard convension, please use MCDS_TCXPAL2_RNG.
*/
#define MCDS_TCXPALRNG2 (MCDS_TCXPAL2_RNG)

/** \brief 2238, Lookup Table Mapping Register */
#define MCDS_TCXPAL2_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXPAL_MAP*)0xFA012238u)
/** Alias (User Manual Name) for MCDS_TCXPAL2_MAP.
* To use register names with standard convension, please use MCDS_TCXPAL2_MAP.
*/
#define MCDS_TCXPALMAP2 (MCDS_TCXPAL2_MAP)

/** \brief 2240, Lookup Table Base Register */
#define MCDS_TCXPAL3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXPAL_BND*)0xFA012240u)
/** Alias (User Manual Name) for MCDS_TCXPAL3_BND.
* To use register names with standard convension, please use MCDS_TCXPAL3_BND.
*/
#define MCDS_TCXPALBND3 (MCDS_TCXPAL3_BND)

/** \brief 2244, Lookup Table Range Register */
#define MCDS_TCXPAL3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXPAL_RNG*)0xFA012244u)
/** Alias (User Manual Name) for MCDS_TCXPAL3_RNG.
* To use register names with standard convension, please use MCDS_TCXPAL3_RNG.
*/
#define MCDS_TCXPALRNG3 (MCDS_TCXPAL3_RNG)

/** \brief 2248, Lookup Table Mapping Register */
#define MCDS_TCXPAL3_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXPAL_MAP*)0xFA012248u)
/** Alias (User Manual Name) for MCDS_TCXPAL3_MAP.
* To use register names with standard convension, please use MCDS_TCXPAL3_MAP.
*/
#define MCDS_TCXPALMAP3 (MCDS_TCXPAL3_MAP)

/** \brief 2400, Comparator Bound Register 0 */
#define MCDS_TCXEA0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_BND*)0xFA012400u)
/** Alias (User Manual Name) for MCDS_TCXEA0_BND.
* To use register names with standard convension, please use MCDS_TCXEA0_BND.
*/
#define MCDS_TCXEABND0 (MCDS_TCXEA0_BND)

/** \brief 2404, Comparator Range Register 0 */
#define MCDS_TCXEA0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_RNG*)0xFA012404u)
/** Alias (User Manual Name) for MCDS_TCXEA0_RNG.
* To use register names with standard convension, please use MCDS_TCXEA0_RNG.
*/
#define MCDS_TCXEARNG0 (MCDS_TCXEA0_RNG)

/** \brief 2410, Comparator Bound Register 1 */
#define MCDS_TCXEA1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_BND*)0xFA012410u)
/** Alias (User Manual Name) for MCDS_TCXEA1_BND.
* To use register names with standard convension, please use MCDS_TCXEA1_BND.
*/
#define MCDS_TCXEABND1 (MCDS_TCXEA1_BND)

/** \brief 2414, Comparator Range Register 1 */
#define MCDS_TCXEA1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_RNG*)0xFA012414u)
/** Alias (User Manual Name) for MCDS_TCXEA1_RNG.
* To use register names with standard convension, please use MCDS_TCXEA1_RNG.
*/
#define MCDS_TCXEARNG1 (MCDS_TCXEA1_RNG)

