HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMcds_reg.h
/** \brief 2420, Comparator Bound Register 2 */
#define MCDS_TCXEA2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_BND*)0xFA012420u)
/** Alias (User Manual Name) for MCDS_TCXEA2_BND.
* To use register names with standard convension, please use MCDS_TCXEA2_BND.
*/
#define MCDS_TCXEABND2 (MCDS_TCXEA2_BND)

/** \brief 2424, Comparator Range Register 2 */
#define MCDS_TCXEA2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_RNG*)0xFA012424u)
/** Alias (User Manual Name) for MCDS_TCXEA2_RNG.
* To use register names with standard convension, please use MCDS_TCXEA2_RNG.
*/
#define MCDS_TCXEARNG2 (MCDS_TCXEA2_RNG)

/** \brief 2430, Comparator Bound Register 3 */
#define MCDS_TCXEA3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_BND*)0xFA012430u)
/** Alias (User Manual Name) for MCDS_TCXEA3_BND.
* To use register names with standard convension, please use MCDS_TCXEA3_BND.
*/
#define MCDS_TCXEABND3 (MCDS_TCXEA3_BND)

/** \brief 2434, Comparator Range Register 3 */
#define MCDS_TCXEA3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_RNG*)0xFA012434u)
/** Alias (User Manual Name) for MCDS_TCXEA3_RNG.
* To use register names with standard convension, please use MCDS_TCXEA3_RNG.
*/
#define MCDS_TCXEARNG3 (MCDS_TCXEA3_RNG)

/** \brief 2440, Comparator Bound Register 4 */
#define MCDS_TCXEA4_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_BND*)0xFA012440u)
/** Alias (User Manual Name) for MCDS_TCXEA4_BND.
* To use register names with standard convension, please use MCDS_TCXEA4_BND.
*/
#define MCDS_TCXEABND4 (MCDS_TCXEA4_BND)

/** \brief 2444, Comparator Range Register 4 */
#define MCDS_TCXEA4_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_RNG*)0xFA012444u)
/** Alias (User Manual Name) for MCDS_TCXEA4_RNG.
* To use register names with standard convension, please use MCDS_TCXEA4_RNG.
*/
#define MCDS_TCXEARNG4 (MCDS_TCXEA4_RNG)

/** \brief 2450, Comparator Bound Register 5 */
#define MCDS_TCXEA5_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_BND*)0xFA012450u)
/** Alias (User Manual Name) for MCDS_TCXEA5_BND.
* To use register names with standard convension, please use MCDS_TCXEA5_BND.
*/
#define MCDS_TCXEABND5 (MCDS_TCXEA5_BND)

/** \brief 2454, Comparator Range Register 5 */
#define MCDS_TCXEA5_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_RNG*)0xFA012454u)
/** Alias (User Manual Name) for MCDS_TCXEA5_RNG.
* To use register names with standard convension, please use MCDS_TCXEA5_RNG.
*/
#define MCDS_TCXEARNG5 (MCDS_TCXEA5_RNG)

/** \brief 2460, Comparator Bound Register 6 */
#define MCDS_TCXEA6_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_BND*)0xFA012460u)
/** Alias (User Manual Name) for MCDS_TCXEA6_BND.
* To use register names with standard convension, please use MCDS_TCXEA6_BND.
*/
#define MCDS_TCXEABND6 (MCDS_TCXEA6_BND)

/** \brief 2464, Comparator Range Register 6 */
#define MCDS_TCXEA6_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_RNG*)0xFA012464u)
/** Alias (User Manual Name) for MCDS_TCXEA6_RNG.
* To use register names with standard convension, please use MCDS_TCXEA6_RNG.
*/
#define MCDS_TCXEARNG6 (MCDS_TCXEA6_RNG)

/** \brief 2470, Comparator Bound Register 7 */
#define MCDS_TCXEA7_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_BND*)0xFA012470u)
/** Alias (User Manual Name) for MCDS_TCXEA7_BND.
* To use register names with standard convension, please use MCDS_TCXEA7_BND.
*/
#define MCDS_TCXEABND7 (MCDS_TCXEA7_BND)

/** \brief 2474, Comparator Range Register 7 */
#define MCDS_TCXEA7_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_RNG*)0xFA012474u)
/** Alias (User Manual Name) for MCDS_TCXEA7_RNG.
* To use register names with standard convension, please use MCDS_TCXEA7_RNG.
*/
#define MCDS_TCXEARNG7 (MCDS_TCXEA7_RNG)

/** \brief 2480, Comparator Bound Register 0 */
#define MCDS_TCXWD0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_BND*)0xFA012480u)
/** Alias (User Manual Name) for MCDS_TCXWD0_BND.
* To use register names with standard convension, please use MCDS_TCXWD0_BND.
*/
#define MCDS_TCXWDBND0 (MCDS_TCXWD0_BND)

/** \brief 2484, Comparator Bound Register 0 */
#define MCDS_TCXWD0_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_HBND*)0xFA012484u)
/** Alias (User Manual Name) for MCDS_TCXWD0_HBND.
* To use register names with standard convension, please use MCDS_TCXWD0_HBND.
*/
#define MCDS_TCXWDHBND0 (MCDS_TCXWD0_HBND)

/** \brief 2488, Comparator Range Register 0 */
#define MCDS_TCXWD0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_RNG*)0xFA012488u)
/** Alias (User Manual Name) for MCDS_TCXWD0_RNG.
* To use register names with standard convension, please use MCDS_TCXWD0_RNG.
*/
#define MCDS_TCXWDRNG0 (MCDS_TCXWD0_RNG)

/** \brief 248C, Comparator Range Register 0 */
#define MCDS_TCXWD0_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_HRNG*)0xFA01248Cu)
/** Alias (User Manual Name) for MCDS_TCXWD0_HRNG.
* To use register names with standard convension, please use MCDS_TCXWD0_HRNG.
*/
#define MCDS_TCXWDHRNG0 (MCDS_TCXWD0_HRNG)

/** \brief 2490, Comparator Mask Register 0 */
#define MCDS_TCXWD0_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_MSK*)0xFA012490u)
/** Alias (User Manual Name) for MCDS_TCXWD0_MSK.
* To use register names with standard convension, please use MCDS_TCXWD0_MSK.
*/
#define MCDS_TCXWDMSK0 (MCDS_TCXWD0_MSK)

/** \brief 2494, Comparator Mask Register 0 */
#define MCDS_TCXWD0_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_HMSK*)0xFA012494u)
/** Alias (User Manual Name) for MCDS_TCXWD0_HMSK.
* To use register names with standard convension, please use MCDS_TCXWD0_HMSK.
*/
#define MCDS_TCXWDHMSK0 (MCDS_TCXWD0_HMSK)

/** \brief 249C, Comparator Sign Register 0 */
#define MCDS_TCXWD0_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_SGN*)0xFA01249Cu)
/** Alias (User Manual Name) for MCDS_TCXWD0_SGN.
* To use register names with standard convension, please use MCDS_TCXWD0_SGN.
*/
#define MCDS_TCXWDSGN0 (MCDS_TCXWD0_SGN)

/** \brief 24A0, Comparator Bound Register 1 */
#define MCDS_TCXWD1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_BND*)0xFA0124A0u)
/** Alias (User Manual Name) for MCDS_TCXWD1_BND.
* To use register names with standard convension, please use MCDS_TCXWD1_BND.
*/
#define MCDS_TCXWDBND1 (MCDS_TCXWD1_BND)

/** \brief 24A4, Comparator Bound Register 1 */
#define MCDS_TCXWD1_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_HBND*)0xFA0124A4u)
/** Alias (User Manual Name) for MCDS_TCXWD1_HBND.
* To use register names with standard convension, please use MCDS_TCXWD1_HBND.
*/
#define MCDS_TCXWDHBND1 (MCDS_TCXWD1_HBND)

/** \brief 24A8, Comparator Range Register 1 */
#define MCDS_TCXWD1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_RNG*)0xFA0124A8u)
/** Alias (User Manual Name) for MCDS_TCXWD1_RNG.
* To use register names with standard convension, please use MCDS_TCXWD1_RNG.
*/
#define MCDS_TCXWDRNG1 (MCDS_TCXWD1_RNG)

/** \brief 24AC, Comparator Range Register 1 */
#define MCDS_TCXWD1_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_HRNG*)0xFA0124ACu)
/** Alias (User Manual Name) for MCDS_TCXWD1_HRNG.
* To use register names with standard convension, please use MCDS_TCXWD1_HRNG.
*/
#define MCDS_TCXWDHRNG1 (MCDS_TCXWD1_HRNG)

/** \brief 24B0, Comparator Mask Register 1 */
#define MCDS_TCXWD1_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_MSK*)0xFA0124B0u)
/** Alias (User Manual Name) for MCDS_TCXWD1_MSK.
* To use register names with standard convension, please use MCDS_TCXWD1_MSK.
*/
#define MCDS_TCXWDMSK1 (MCDS_TCXWD1_MSK)

