HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMcds_reg.h
/** \brief 24B4, Comparator Mask Register 1 */
#define MCDS_TCXWD1_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_HMSK*)0xFA0124B4u)
/** Alias (User Manual Name) for MCDS_TCXWD1_HMSK.
* To use register names with standard convension, please use MCDS_TCXWD1_HMSK.
*/
#define MCDS_TCXWDHMSK1 (MCDS_TCXWD1_HMSK)

/** \brief 24BC, Comparator Sign Register 1 */
#define MCDS_TCXWD1_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_SGN*)0xFA0124BCu)
/** Alias (User Manual Name) for MCDS_TCXWD1_SGN.
* To use register names with standard convension, please use MCDS_TCXWD1_SGN.
*/
#define MCDS_TCXWDSGN1 (MCDS_TCXWD1_SGN)

/** \brief 24C0, Comparator Bound Register 2 */
#define MCDS_TCXWD2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_BND*)0xFA0124C0u)
/** Alias (User Manual Name) for MCDS_TCXWD2_BND.
* To use register names with standard convension, please use MCDS_TCXWD2_BND.
*/
#define MCDS_TCXWDBND2 (MCDS_TCXWD2_BND)

/** \brief 24C4, Comparator Bound Register 2 */
#define MCDS_TCXWD2_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_HBND*)0xFA0124C4u)
/** Alias (User Manual Name) for MCDS_TCXWD2_HBND.
* To use register names with standard convension, please use MCDS_TCXWD2_HBND.
*/
#define MCDS_TCXWDHBND2 (MCDS_TCXWD2_HBND)

/** \brief 24C8, Comparator Range Register 2 */
#define MCDS_TCXWD2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_RNG*)0xFA0124C8u)
/** Alias (User Manual Name) for MCDS_TCXWD2_RNG.
* To use register names with standard convension, please use MCDS_TCXWD2_RNG.
*/
#define MCDS_TCXWDRNG2 (MCDS_TCXWD2_RNG)

/** \brief 24CC, Comparator Range Register 2 */
#define MCDS_TCXWD2_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_HRNG*)0xFA0124CCu)
/** Alias (User Manual Name) for MCDS_TCXWD2_HRNG.
* To use register names with standard convension, please use MCDS_TCXWD2_HRNG.
*/
#define MCDS_TCXWDHRNG2 (MCDS_TCXWD2_HRNG)

/** \brief 24D0, Comparator Mask Register 2 */
#define MCDS_TCXWD2_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_MSK*)0xFA0124D0u)
/** Alias (User Manual Name) for MCDS_TCXWD2_MSK.
* To use register names with standard convension, please use MCDS_TCXWD2_MSK.
*/
#define MCDS_TCXWDMSK2 (MCDS_TCXWD2_MSK)

/** \brief 24D4, Comparator Mask Register 2 */
#define MCDS_TCXWD2_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_HMSK*)0xFA0124D4u)
/** Alias (User Manual Name) for MCDS_TCXWD2_HMSK.
* To use register names with standard convension, please use MCDS_TCXWD2_HMSK.
*/
#define MCDS_TCXWDHMSK2 (MCDS_TCXWD2_HMSK)

/** \brief 24DC, Comparator Sign Register 2 */
#define MCDS_TCXWD2_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_SGN*)0xFA0124DCu)
/** Alias (User Manual Name) for MCDS_TCXWD2_SGN.
* To use register names with standard convension, please use MCDS_TCXWD2_SGN.
*/
#define MCDS_TCXWDSGN2 (MCDS_TCXWD2_SGN)

/** \brief 24E0, Comparator Bound Register 3 */
#define MCDS_TCXWD3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_BND*)0xFA0124E0u)
/** Alias (User Manual Name) for MCDS_TCXWD3_BND.
* To use register names with standard convension, please use MCDS_TCXWD3_BND.
*/
#define MCDS_TCXWDBND3 (MCDS_TCXWD3_BND)

/** \brief 24E4, Comparator Bound Register 3 */
#define MCDS_TCXWD3_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_HBND*)0xFA0124E4u)
/** Alias (User Manual Name) for MCDS_TCXWD3_HBND.
* To use register names with standard convension, please use MCDS_TCXWD3_HBND.
*/
#define MCDS_TCXWDHBND3 (MCDS_TCXWD3_HBND)

/** \brief 24E8, Comparator Range Register 3 */
#define MCDS_TCXWD3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_RNG*)0xFA0124E8u)
/** Alias (User Manual Name) for MCDS_TCXWD3_RNG.
* To use register names with standard convension, please use MCDS_TCXWD3_RNG.
*/
#define MCDS_TCXWDRNG3 (MCDS_TCXWD3_RNG)

/** \brief 24EC, Comparator Range Register 3 */
#define MCDS_TCXWD3_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_HRNG*)0xFA0124ECu)
/** Alias (User Manual Name) for MCDS_TCXWD3_HRNG.
* To use register names with standard convension, please use MCDS_TCXWD3_HRNG.
*/
#define MCDS_TCXWDHRNG3 (MCDS_TCXWD3_HRNG)

/** \brief 24F0, Comparator Mask Register 3 */
#define MCDS_TCXWD3_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_MSK*)0xFA0124F0u)
/** Alias (User Manual Name) for MCDS_TCXWD3_MSK.
* To use register names with standard convension, please use MCDS_TCXWD3_MSK.
*/
#define MCDS_TCXWDMSK3 (MCDS_TCXWD3_MSK)

/** \brief 24F4, Comparator Mask Register 3 */
#define MCDS_TCXWD3_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_HMSK*)0xFA0124F4u)
/** Alias (User Manual Name) for MCDS_TCXWD3_HMSK.
* To use register names with standard convension, please use MCDS_TCXWD3_HMSK.
*/
#define MCDS_TCXWDHMSK3 (MCDS_TCXWD3_HMSK)

/** \brief 24FC, Comparator Sign Register 3 */
#define MCDS_TCXWD3_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_SGN*)0xFA0124FCu)
/** Alias (User Manual Name) for MCDS_TCXWD3_SGN.
* To use register names with standard convension, please use MCDS_TCXWD3_SGN.
*/
#define MCDS_TCXWDSGN3 (MCDS_TCXWD3_SGN)

/** \brief 2500, Comparator Bound Register 0 */
#define MCDS_TCXAC0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXAC_BND*)0xFA012500u)
/** Alias (User Manual Name) for MCDS_TCXAC0_BND.
* To use register names with standard convension, please use MCDS_TCXAC0_BND.
*/
#define MCDS_TCXACBND0 (MCDS_TCXAC0_BND)

/** \brief 2504, Comparator Range Register 0 */
#define MCDS_TCXAC0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXAC_RNG*)0xFA012504u)
/** Alias (User Manual Name) for MCDS_TCXAC0_RNG.
* To use register names with standard convension, please use MCDS_TCXAC0_RNG.
*/
#define MCDS_TCXACRNG0 (MCDS_TCXAC0_RNG)

/** \brief 2508, Comparator Mask Register 0 */
#define MCDS_TCXAC0_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXAC_MSK*)0xFA012508u)
/** Alias (User Manual Name) for MCDS_TCXAC0_MSK.
* To use register names with standard convension, please use MCDS_TCXAC0_MSK.
*/
#define MCDS_TCXACMSK0 (MCDS_TCXAC0_MSK)

/** \brief 2510, Comparator Bound Register 1 */
#define MCDS_TCXAC1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXAC_BND*)0xFA012510u)
/** Alias (User Manual Name) for MCDS_TCXAC1_BND.
* To use register names with standard convension, please use MCDS_TCXAC1_BND.
*/
#define MCDS_TCXACBND1 (MCDS_TCXAC1_BND)

/** \brief 2514, Comparator Range Register 1 */
#define MCDS_TCXAC1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXAC_RNG*)0xFA012514u)
/** Alias (User Manual Name) for MCDS_TCXAC1_RNG.
* To use register names with standard convension, please use MCDS_TCXAC1_RNG.
*/
#define MCDS_TCXACRNG1 (MCDS_TCXAC1_RNG)

