HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMcds_reg.h
/** \brief 2518, Comparator Mask Register 1 */
#define MCDS_TCXAC1_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXAC_MSK*)0xFA012518u)
/** Alias (User Manual Name) for MCDS_TCXAC1_MSK.
* To use register names with standard convension, please use MCDS_TCXAC1_MSK.
*/
#define MCDS_TCXACMSK1 (MCDS_TCXAC1_MSK)

/** \brief 2520, Comparator Bound Register 2 */
#define MCDS_TCXAC2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXAC_BND*)0xFA012520u)
/** Alias (User Manual Name) for MCDS_TCXAC2_BND.
* To use register names with standard convension, please use MCDS_TCXAC2_BND.
*/
#define MCDS_TCXACBND2 (MCDS_TCXAC2_BND)

/** \brief 2524, Comparator Range Register 2 */
#define MCDS_TCXAC2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXAC_RNG*)0xFA012524u)
/** Alias (User Manual Name) for MCDS_TCXAC2_RNG.
* To use register names with standard convension, please use MCDS_TCXAC2_RNG.
*/
#define MCDS_TCXACRNG2 (MCDS_TCXAC2_RNG)

/** \brief 2528, Comparator Mask Register 2 */
#define MCDS_TCXAC2_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXAC_MSK*)0xFA012528u)
/** Alias (User Manual Name) for MCDS_TCXAC2_MSK.
* To use register names with standard convension, please use MCDS_TCXAC2_MSK.
*/
#define MCDS_TCXACMSK2 (MCDS_TCXAC2_MSK)

/** \brief 2530, Comparator Bound Register 3 */
#define MCDS_TCXAC3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXAC_BND*)0xFA012530u)
/** Alias (User Manual Name) for MCDS_TCXAC3_BND.
* To use register names with standard convension, please use MCDS_TCXAC3_BND.
*/
#define MCDS_TCXACBND3 (MCDS_TCXAC3_BND)

/** \brief 2534, Comparator Range Register 3 */
#define MCDS_TCXAC3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXAC_RNG*)0xFA012534u)
/** Alias (User Manual Name) for MCDS_TCXAC3_RNG.
* To use register names with standard convension, please use MCDS_TCXAC3_RNG.
*/
#define MCDS_TCXACRNG3 (MCDS_TCXAC3_RNG)

/** \brief 2538, Comparator Mask Register 3 */
#define MCDS_TCXAC3_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXAC_MSK*)0xFA012538u)
/** Alias (User Manual Name) for MCDS_TCXAC3_MSK.
* To use register names with standard convension, please use MCDS_TCXAC3_MSK.
*/
#define MCDS_TCXACMSK3 (MCDS_TCXAC3_MSK)

/** \brief 2580, DTU FIFOs Fill Level */
#define MCDS_TCXDTUFLV /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXDTUFLV*)0xFA012580u)

/** \brief 2800, Event Definition Register 0 */
#define MCDS_TCXEVT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA012800u)

/** \brief 2804, Event Definition Register 1 */
#define MCDS_TCXEVT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA012804u)

/** \brief 2808, Event Definition Register 2 */
#define MCDS_TCXEVT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA012808u)

/** \brief 280C, Event Definition Register 3 */
#define MCDS_TCXEVT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA01280Cu)

/** \brief 2810, Event Definition Register 4 */
#define MCDS_TCXEVT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA012810u)

/** \brief 2814, Event Definition Register 5 */
#define MCDS_TCXEVT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA012814u)

/** \brief 2818, Event Definition Register 6 */
#define MCDS_TCXEVT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA012818u)

/** \brief 281C, Event Definition Register 7 */
#define MCDS_TCXEVT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA01281Cu)

/** \brief 2820, Event Definition Register 8 */
#define MCDS_TCXEVT8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA012820u)

/** \brief 2824, Event Definition Register 9 */
#define MCDS_TCXEVT9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA012824u)

/** \brief 2828, Event Definition Register 10 */
#define MCDS_TCXEVT10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA012828u)

/** \brief 282C, Event Definition Register 11 */
#define MCDS_TCXEVT11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA01282Cu)

/** \brief 2830, Event Definition Register 12 */
#define MCDS_TCXEVT12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA012830u)

/** \brief 2834, Event Definition Register 13 */
#define MCDS_TCXEVT13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA012834u)

/** \brief 2838, Event Definition Register 14 */
#define MCDS_TCXEVT14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA012838u)

/** \brief 283C, Event Definition Register 15 */
#define MCDS_TCXEVT15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEVT*)0xFA01283Cu)

/** \brief 2880, Action Definition Register 0 */
#define MCDS_TCXACT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA012880u)

/** \brief 2884, Action Definition Register 1 */
#define MCDS_TCXACT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA012884u)

/** \brief 2888, Action Definition Register 2 */
#define MCDS_TCXACT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA012888u)

/** \brief 288C, Action Definition Register 3 */
#define MCDS_TCXACT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA01288Cu)

/** \brief 2890, Action Definition Register 4 */
#define MCDS_TCXACT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA012890u)

/** \brief 2894, Action Definition Register 5 */
#define MCDS_TCXACT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA012894u)

/** \brief 2898, Action Definition Register 6 */
#define MCDS_TCXACT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA012898u)

/** \brief 289C, Action Definition Register 7 */
#define MCDS_TCXACT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA01289Cu)

/** \brief 28A0, Action Definition Register 8 */
#define MCDS_TCXACT8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128A0u)

/** \brief 28A4, Action Definition Register 9 */
#define MCDS_TCXACT9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128A4u)

/** \brief 28A8, Action Definition Register 10 */
#define MCDS_TCXACT10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128A8u)

/** \brief 28AC, Action Definition Register 11 */
#define MCDS_TCXACT11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128ACu)

/** \brief 28B0, Action Definition Register 12 */
#define MCDS_TCXACT12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128B0u)

