HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMcds_reg.h
/** \brief 28B4, Action Definition Register 13 */
#define MCDS_TCXACT13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128B4u)

/** \brief 28B8, Action Definition Register 14 */
#define MCDS_TCXACT14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128B8u)

/** \brief 28BC, Action Definition Register 15 */
#define MCDS_TCXACT15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128BCu)

/** \brief 28C0, Action Definition Register 16 */
#define MCDS_TCXACT16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128C0u)

/** \brief 28C4, Action Definition Register 17 */
#define MCDS_TCXACT17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128C4u)

/** \brief 28C8, Action Definition Register 18 */
#define MCDS_TCXACT18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128C8u)

/** \brief 28CC, Action Definition Register 19 */
#define MCDS_TCXACT19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128CCu)

/** \brief 28D0, Action Definition Register 20 */
#define MCDS_TCXACT20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128D0u)

/** \brief 28D4, Action Definition Register 21 */
#define MCDS_TCXACT21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128D4u)

/** \brief 28D8, Action Definition Register 22 */
#define MCDS_TCXACT22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128D8u)

/** \brief 28DC, Action Definition Register 23 */
#define MCDS_TCXACT23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXACT*)0xFA0128DCu)

/** \brief 2C00, Comparator Bound Register 0 */
#define MCDS_TCXID0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXID_BND*)0xFA012C00u)
/** Alias (User Manual Name) for MCDS_TCXID0_BND.
* To use register names with standard convension, please use MCDS_TCXID0_BND.
*/
#define MCDS_TCXIDBND0 (MCDS_TCXID0_BND)

/** \brief 2C04, Comparator Range Register 0 */
#define MCDS_TCXID0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXID_RNG*)0xFA012C04u)
/** Alias (User Manual Name) for MCDS_TCXID0_RNG.
* To use register names with standard convension, please use MCDS_TCXID0_RNG.
*/
#define MCDS_TCXIDRNG0 (MCDS_TCXID0_RNG)

/** \brief 2C08, Comparator Mask Register 0 */
#define MCDS_TCXID0_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXID_MSK*)0xFA012C08u)
/** Alias (User Manual Name) for MCDS_TCXID0_MSK.
* To use register names with standard convension, please use MCDS_TCXID0_MSK.
*/
#define MCDS_TCXIDMSK0 (MCDS_TCXID0_MSK)

/** \brief 2C0C, Comparator Sign Register 0 */
#define MCDS_TCXID0_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXID_SGN*)0xFA012C0Cu)
/** Alias (User Manual Name) for MCDS_TCXID0_SGN.
* To use register names with standard convension, please use MCDS_TCXID0_SGN.
*/
#define MCDS_TCXIDSGN0 (MCDS_TCXID0_SGN)

/** \brief 2C10, Comparator Bound Register 1 */
#define MCDS_TCXID1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXID_BND*)0xFA012C10u)
/** Alias (User Manual Name) for MCDS_TCXID1_BND.
* To use register names with standard convension, please use MCDS_TCXID1_BND.
*/
#define MCDS_TCXIDBND1 (MCDS_TCXID1_BND)

/** \brief 2C14, Comparator Range Register 1 */
#define MCDS_TCXID1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXID_RNG*)0xFA012C14u)
/** Alias (User Manual Name) for MCDS_TCXID1_RNG.
* To use register names with standard convension, please use MCDS_TCXID1_RNG.
*/
#define MCDS_TCXIDRNG1 (MCDS_TCXID1_RNG)

/** \brief 2C18, Comparator Mask Register 1 */
#define MCDS_TCXID1_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXID_MSK*)0xFA012C18u)
/** Alias (User Manual Name) for MCDS_TCXID1_MSK.
* To use register names with standard convension, please use MCDS_TCXID1_MSK.
*/
#define MCDS_TCXIDMSK1 (MCDS_TCXID1_MSK)

/** \brief 2C1C, Comparator Sign Register 1 */
#define MCDS_TCXID1_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXID_SGN*)0xFA012C1Cu)
/** Alias (User Manual Name) for MCDS_TCXID1_SGN.
* To use register names with standard convension, please use MCDS_TCXID1_SGN.
*/
#define MCDS_TCXIDSGN1 (MCDS_TCXID1_SGN)

/** \brief 3000, Comparator Bound Register 0 */
#define MCDS_TCXIP0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXIP_BND*)0xFA013000u)
/** Alias (User Manual Name) for MCDS_TCXIP0_BND.
* To use register names with standard convension, please use MCDS_TCXIP0_BND.
*/
#define MCDS_TCXIPBND0 (MCDS_TCXIP0_BND)

/** \brief 3004, Comparator Range Register 0 */
#define MCDS_TCXIP0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXIP_RNG*)0xFA013004u)
/** Alias (User Manual Name) for MCDS_TCXIP0_RNG.
* To use register names with standard convension, please use MCDS_TCXIP0_RNG.
*/
#define MCDS_TCXIPRNG0 (MCDS_TCXIP0_RNG)

/** \brief 3010, Comparator Bound Register 1 */
#define MCDS_TCXIP1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXIP_BND*)0xFA013010u)
/** Alias (User Manual Name) for MCDS_TCXIP1_BND.
* To use register names with standard convension, please use MCDS_TCXIP1_BND.
*/
#define MCDS_TCXIPBND1 (MCDS_TCXIP1_BND)

/** \brief 3014, Comparator Range Register 1 */
#define MCDS_TCXIP1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXIP_RNG*)0xFA013014u)
/** Alias (User Manual Name) for MCDS_TCXIP1_RNG.
* To use register names with standard convension, please use MCDS_TCXIP1_RNG.
*/
#define MCDS_TCXIPRNG1 (MCDS_TCXIP1_RNG)

/** \brief 3020, Comparator Bound Register 2 */
#define MCDS_TCXIP2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXIP_BND*)0xFA013020u)
/** Alias (User Manual Name) for MCDS_TCXIP2_BND.
* To use register names with standard convension, please use MCDS_TCXIP2_BND.
*/
#define MCDS_TCXIPBND2 (MCDS_TCXIP2_BND)

/** \brief 3024, Comparator Range Register 2 */
#define MCDS_TCXIP2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXIP_RNG*)0xFA013024u)
/** Alias (User Manual Name) for MCDS_TCXIP2_RNG.
* To use register names with standard convension, please use MCDS_TCXIP2_RNG.
*/
#define MCDS_TCXIPRNG2 (MCDS_TCXIP2_RNG)

/** \brief 3030, Comparator Bound Register 3 */
#define MCDS_TCXIP3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXIP_BND*)0xFA013030u)
/** Alias (User Manual Name) for MCDS_TCXIP3_BND.
* To use register names with standard convension, please use MCDS_TCXIP3_BND.
*/
#define MCDS_TCXIPBND3 (MCDS_TCXIP3_BND)

/** \brief 3034, Comparator Range Register 3 */
#define MCDS_TCXIP3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXIP_RNG*)0xFA013034u)
/** Alias (User Manual Name) for MCDS_TCXIP3_RNG.
* To use register names with standard convension, please use MCDS_TCXIP3_RNG.
*/
#define MCDS_TCXIPRNG3 (MCDS_TCXIP3_RNG)

/** \brief 3040, Comparator Bound Register 4 */
#define MCDS_TCXIP4_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXIP_BND*)0xFA013040u)
/** Alias (User Manual Name) for MCDS_TCXIP4_BND.
* To use register names with standard convension, please use MCDS_TCXIP4_BND.
*/
#define MCDS_TCXIPBND4 (MCDS_TCXIP4_BND)

/** \brief 3044, Comparator Range Register 4 */
#define MCDS_TCXIP4_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXIP_RNG*)0xFA013044u)
/** Alias (User Manual Name) for MCDS_TCXIP4_RNG.
* To use register names with standard convension, please use MCDS_TCXIP4_RNG.
*/
#define MCDS_TCXIPRNG4 (MCDS_TCXIP4_RNG)

