HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMcds_reg.h
/** \brief 3050, Comparator Bound Register 5 */
#define MCDS_TCXIP5_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXIP_BND*)0xFA013050u)
/** Alias (User Manual Name) for MCDS_TCXIP5_BND.
* To use register names with standard convension, please use MCDS_TCXIP5_BND.
*/
#define MCDS_TCXIPBND5 (MCDS_TCXIP5_BND)

/** \brief 3054, Comparator Range Register 5 */
#define MCDS_TCXIP5_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXIP_RNG*)0xFA013054u)
/** Alias (User Manual Name) for MCDS_TCXIP5_RNG.
* To use register names with standard convension, please use MCDS_TCXIP5_RNG.
*/
#define MCDS_TCXIPRNG5 (MCDS_TCXIP5_RNG)

/** \brief 4000, Debug Status Register */
#define MCDS_TCYDCSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYDCSTS*)0xFA014000u)

/** \brief 4004, Current Process ID */
#define MCDS_TCYCID /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYCID*)0xFA014004u)

/** \brief 4008, Current Instruction Pointer */
#define MCDS_TCYCIP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYCIP*)0xFA014008u)

/** \brief 400C, Compact Function Trace Register */
#define MCDS_TCYCFT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYCFT*)0xFA01400Cu)

/** \brief 4200, Lookup Table Data Register */
#define MCDS_TCYPALLUTD /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYPALLUTD*)0xFA014200u)

/** \brief 4204, Lookup Table Address Register */
#define MCDS_TCYPALLUTA /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYPALLUTA*)0xFA014204u)

/** \brief 4210, Lookup Table Base Register */
#define MCDS_TCYPAL0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYPAL_BND*)0xFA014210u)
/** Alias (User Manual Name) for MCDS_TCYPAL0_BND.
* To use register names with standard convension, please use MCDS_TCYPAL0_BND.
*/
#define MCDS_TCYPALBND0 (MCDS_TCYPAL0_BND)

/** \brief 4214, Lookup Table Range Register */
#define MCDS_TCYPAL0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYPAL_RNG*)0xFA014214u)
/** Alias (User Manual Name) for MCDS_TCYPAL0_RNG.
* To use register names with standard convension, please use MCDS_TCYPAL0_RNG.
*/
#define MCDS_TCYPALRNG0 (MCDS_TCYPAL0_RNG)

/** \brief 4218, Lookup Table Mapping Register */
#define MCDS_TCYPAL0_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYPAL_MAP*)0xFA014218u)
/** Alias (User Manual Name) for MCDS_TCYPAL0_MAP.
* To use register names with standard convension, please use MCDS_TCYPAL0_MAP.
*/
#define MCDS_TCYPALMAP0 (MCDS_TCYPAL0_MAP)

/** \brief 4220, Lookup Table Base Register */
#define MCDS_TCYPAL1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYPAL_BND*)0xFA014220u)
/** Alias (User Manual Name) for MCDS_TCYPAL1_BND.
* To use register names with standard convension, please use MCDS_TCYPAL1_BND.
*/
#define MCDS_TCYPALBND1 (MCDS_TCYPAL1_BND)

/** \brief 4224, Lookup Table Range Register */
#define MCDS_TCYPAL1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYPAL_RNG*)0xFA014224u)
/** Alias (User Manual Name) for MCDS_TCYPAL1_RNG.
* To use register names with standard convension, please use MCDS_TCYPAL1_RNG.
*/
#define MCDS_TCYPALRNG1 (MCDS_TCYPAL1_RNG)

/** \brief 4228, Lookup Table Mapping Register */
#define MCDS_TCYPAL1_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYPAL_MAP*)0xFA014228u)
/** Alias (User Manual Name) for MCDS_TCYPAL1_MAP.
* To use register names with standard convension, please use MCDS_TCYPAL1_MAP.
*/
#define MCDS_TCYPALMAP1 (MCDS_TCYPAL1_MAP)

/** \brief 4230, Lookup Table Base Register */
#define MCDS_TCYPAL2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYPAL_BND*)0xFA014230u)
/** Alias (User Manual Name) for MCDS_TCYPAL2_BND.
* To use register names with standard convension, please use MCDS_TCYPAL2_BND.
*/
#define MCDS_TCYPALBND2 (MCDS_TCYPAL2_BND)

/** \brief 4234, Lookup Table Range Register */
#define MCDS_TCYPAL2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYPAL_RNG*)0xFA014234u)
/** Alias (User Manual Name) for MCDS_TCYPAL2_RNG.
* To use register names with standard convension, please use MCDS_TCYPAL2_RNG.
*/
#define MCDS_TCYPALRNG2 (MCDS_TCYPAL2_RNG)

/** \brief 4238, Lookup Table Mapping Register */
#define MCDS_TCYPAL2_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYPAL_MAP*)0xFA014238u)
/** Alias (User Manual Name) for MCDS_TCYPAL2_MAP.
* To use register names with standard convension, please use MCDS_TCYPAL2_MAP.
*/
#define MCDS_TCYPALMAP2 (MCDS_TCYPAL2_MAP)

/** \brief 4240, Lookup Table Base Register */
#define MCDS_TCYPAL3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYPAL_BND*)0xFA014240u)
/** Alias (User Manual Name) for MCDS_TCYPAL3_BND.
* To use register names with standard convension, please use MCDS_TCYPAL3_BND.
*/
#define MCDS_TCYPALBND3 (MCDS_TCYPAL3_BND)

/** \brief 4244, Lookup Table Range Register */
#define MCDS_TCYPAL3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYPAL_RNG*)0xFA014244u)
/** Alias (User Manual Name) for MCDS_TCYPAL3_RNG.
* To use register names with standard convension, please use MCDS_TCYPAL3_RNG.
*/
#define MCDS_TCYPALRNG3 (MCDS_TCYPAL3_RNG)

/** \brief 4248, Lookup Table Mapping Register */
#define MCDS_TCYPAL3_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYPAL_MAP*)0xFA014248u)
/** Alias (User Manual Name) for MCDS_TCYPAL3_MAP.
* To use register names with standard convension, please use MCDS_TCYPAL3_MAP.
*/
#define MCDS_TCYPALMAP3 (MCDS_TCYPAL3_MAP)

/** \brief 4400, Comparator Bound Register 0 */
#define MCDS_TCYEA0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_BND*)0xFA014400u)
/** Alias (User Manual Name) for MCDS_TCYEA0_BND.
* To use register names with standard convension, please use MCDS_TCYEA0_BND.
*/
#define MCDS_TCYEABND0 (MCDS_TCYEA0_BND)

/** \brief 4404, Comparator Range Register 0 */
#define MCDS_TCYEA0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_RNG*)0xFA014404u)
/** Alias (User Manual Name) for MCDS_TCYEA0_RNG.
* To use register names with standard convension, please use MCDS_TCYEA0_RNG.
*/
#define MCDS_TCYEARNG0 (MCDS_TCYEA0_RNG)

/** \brief 4410, Comparator Bound Register 1 */
#define MCDS_TCYEA1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_BND*)0xFA014410u)
/** Alias (User Manual Name) for MCDS_TCYEA1_BND.
* To use register names with standard convension, please use MCDS_TCYEA1_BND.
*/
#define MCDS_TCYEABND1 (MCDS_TCYEA1_BND)

/** \brief 4414, Comparator Range Register 1 */
#define MCDS_TCYEA1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_RNG*)0xFA014414u)
/** Alias (User Manual Name) for MCDS_TCYEA1_RNG.
* To use register names with standard convension, please use MCDS_TCYEA1_RNG.
*/
#define MCDS_TCYEARNG1 (MCDS_TCYEA1_RNG)

