HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMcds_reg.h
/** \brief 4420, Comparator Bound Register 2 */
#define MCDS_TCYEA2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_BND*)0xFA014420u)
/** Alias (User Manual Name) for MCDS_TCYEA2_BND.
* To use register names with standard convension, please use MCDS_TCYEA2_BND.
*/
#define MCDS_TCYEABND2 (MCDS_TCYEA2_BND)

/** \brief 4424, Comparator Range Register 2 */
#define MCDS_TCYEA2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_RNG*)0xFA014424u)
/** Alias (User Manual Name) for MCDS_TCYEA2_RNG.
* To use register names with standard convension, please use MCDS_TCYEA2_RNG.
*/
#define MCDS_TCYEARNG2 (MCDS_TCYEA2_RNG)

/** \brief 4430, Comparator Bound Register 3 */
#define MCDS_TCYEA3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_BND*)0xFA014430u)
/** Alias (User Manual Name) for MCDS_TCYEA3_BND.
* To use register names with standard convension, please use MCDS_TCYEA3_BND.
*/
#define MCDS_TCYEABND3 (MCDS_TCYEA3_BND)

/** \brief 4434, Comparator Range Register 3 */
#define MCDS_TCYEA3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_RNG*)0xFA014434u)
/** Alias (User Manual Name) for MCDS_TCYEA3_RNG.
* To use register names with standard convension, please use MCDS_TCYEA3_RNG.
*/
#define MCDS_TCYEARNG3 (MCDS_TCYEA3_RNG)

/** \brief 4440, Comparator Bound Register 4 */
#define MCDS_TCYEA4_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_BND*)0xFA014440u)
/** Alias (User Manual Name) for MCDS_TCYEA4_BND.
* To use register names with standard convension, please use MCDS_TCYEA4_BND.
*/
#define MCDS_TCYEABND4 (MCDS_TCYEA4_BND)

/** \brief 4444, Comparator Range Register 4 */
#define MCDS_TCYEA4_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_RNG*)0xFA014444u)
/** Alias (User Manual Name) for MCDS_TCYEA4_RNG.
* To use register names with standard convension, please use MCDS_TCYEA4_RNG.
*/
#define MCDS_TCYEARNG4 (MCDS_TCYEA4_RNG)

/** \brief 4450, Comparator Bound Register 5 */
#define MCDS_TCYEA5_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_BND*)0xFA014450u)
/** Alias (User Manual Name) for MCDS_TCYEA5_BND.
* To use register names with standard convension, please use MCDS_TCYEA5_BND.
*/
#define MCDS_TCYEABND5 (MCDS_TCYEA5_BND)

/** \brief 4454, Comparator Range Register 5 */
#define MCDS_TCYEA5_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_RNG*)0xFA014454u)
/** Alias (User Manual Name) for MCDS_TCYEA5_RNG.
* To use register names with standard convension, please use MCDS_TCYEA5_RNG.
*/
#define MCDS_TCYEARNG5 (MCDS_TCYEA5_RNG)

/** \brief 4460, Comparator Bound Register 6 */
#define MCDS_TCYEA6_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_BND*)0xFA014460u)
/** Alias (User Manual Name) for MCDS_TCYEA6_BND.
* To use register names with standard convension, please use MCDS_TCYEA6_BND.
*/
#define MCDS_TCYEABND6 (MCDS_TCYEA6_BND)

/** \brief 4464, Comparator Range Register 6 */
#define MCDS_TCYEA6_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_RNG*)0xFA014464u)
/** Alias (User Manual Name) for MCDS_TCYEA6_RNG.
* To use register names with standard convension, please use MCDS_TCYEA6_RNG.
*/
#define MCDS_TCYEARNG6 (MCDS_TCYEA6_RNG)

/** \brief 4470, Comparator Bound Register 7 */
#define MCDS_TCYEA7_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_BND*)0xFA014470u)
/** Alias (User Manual Name) for MCDS_TCYEA7_BND.
* To use register names with standard convension, please use MCDS_TCYEA7_BND.
*/
#define MCDS_TCYEABND7 (MCDS_TCYEA7_BND)

/** \brief 4474, Comparator Range Register 7 */
#define MCDS_TCYEA7_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEA_RNG*)0xFA014474u)
/** Alias (User Manual Name) for MCDS_TCYEA7_RNG.
* To use register names with standard convension, please use MCDS_TCYEA7_RNG.
*/
#define MCDS_TCYEARNG7 (MCDS_TCYEA7_RNG)

/** \brief 4480, Comparator Bound Register 0 */
#define MCDS_TCYWD0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_BND*)0xFA014480u)
/** Alias (User Manual Name) for MCDS_TCYWD0_BND.
* To use register names with standard convension, please use MCDS_TCYWD0_BND.
*/
#define MCDS_TCYWDBND0 (MCDS_TCYWD0_BND)

/** \brief 4484, Comparator Bound Register 0 */
#define MCDS_TCYWD0_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_HBND*)0xFA014484u)
/** Alias (User Manual Name) for MCDS_TCYWD0_HBND.
* To use register names with standard convension, please use MCDS_TCYWD0_HBND.
*/
#define MCDS_TCYWDHBND0 (MCDS_TCYWD0_HBND)

/** \brief 4488, Comparator Range Register 0 */
#define MCDS_TCYWD0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_RNG*)0xFA014488u)
/** Alias (User Manual Name) for MCDS_TCYWD0_RNG.
* To use register names with standard convension, please use MCDS_TCYWD0_RNG.
*/
#define MCDS_TCYWDRNG0 (MCDS_TCYWD0_RNG)

/** \brief 448C, Comparator Range Register 0 */
#define MCDS_TCYWD0_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_HRNG*)0xFA01448Cu)
/** Alias (User Manual Name) for MCDS_TCYWD0_HRNG.
* To use register names with standard convension, please use MCDS_TCYWD0_HRNG.
*/
#define MCDS_TCYWDHRNG0 (MCDS_TCYWD0_HRNG)

/** \brief 4490, Comparator Mask Register 0 */
#define MCDS_TCYWD0_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_MSK*)0xFA014490u)
/** Alias (User Manual Name) for MCDS_TCYWD0_MSK.
* To use register names with standard convension, please use MCDS_TCYWD0_MSK.
*/
#define MCDS_TCYWDMSK0 (MCDS_TCYWD0_MSK)

/** \brief 4494, Comparator Mask Register 0 */
#define MCDS_TCYWD0_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_HMSK*)0xFA014494u)
/** Alias (User Manual Name) for MCDS_TCYWD0_HMSK.
* To use register names with standard convension, please use MCDS_TCYWD0_HMSK.
*/
#define MCDS_TCYWDHMSK0 (MCDS_TCYWD0_HMSK)

/** \brief 449C, Comparator Sign Register 0 */
#define MCDS_TCYWD0_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_SGN*)0xFA01449Cu)
/** Alias (User Manual Name) for MCDS_TCYWD0_SGN.
* To use register names with standard convension, please use MCDS_TCYWD0_SGN.
*/
#define MCDS_TCYWDSGN0 (MCDS_TCYWD0_SGN)

/** \brief 44A0, Comparator Bound Register 1 */
#define MCDS_TCYWD1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_BND*)0xFA0144A0u)
/** Alias (User Manual Name) for MCDS_TCYWD1_BND.
* To use register names with standard convension, please use MCDS_TCYWD1_BND.
*/
#define MCDS_TCYWDBND1 (MCDS_TCYWD1_BND)

/** \brief 44A4, Comparator Bound Register 1 */
#define MCDS_TCYWD1_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_HBND*)0xFA0144A4u)
/** Alias (User Manual Name) for MCDS_TCYWD1_HBND.
* To use register names with standard convension, please use MCDS_TCYWD1_HBND.
*/
#define MCDS_TCYWDHBND1 (MCDS_TCYWD1_HBND)

/** \brief 44A8, Comparator Range Register 1 */
#define MCDS_TCYWD1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_RNG*)0xFA0144A8u)
/** Alias (User Manual Name) for MCDS_TCYWD1_RNG.
* To use register names with standard convension, please use MCDS_TCYWD1_RNG.
*/
#define MCDS_TCYWDRNG1 (MCDS_TCYWD1_RNG)

/** \brief 44AC, Comparator Range Register 1 */
#define MCDS_TCYWD1_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_HRNG*)0xFA0144ACu)
/** Alias (User Manual Name) for MCDS_TCYWD1_HRNG.
* To use register names with standard convension, please use MCDS_TCYWD1_HRNG.
*/
#define MCDS_TCYWDHRNG1 (MCDS_TCYWD1_HRNG)

/** \brief 44B0, Comparator Mask Register 1 */
#define MCDS_TCYWD1_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_MSK*)0xFA0144B0u)
/** Alias (User Manual Name) for MCDS_TCYWD1_MSK.
* To use register names with standard convension, please use MCDS_TCYWD1_MSK.
*/
#define MCDS_TCYWDMSK1 (MCDS_TCYWD1_MSK)

/** \brief 44B4, Comparator Mask Register 1 */
#define MCDS_TCYWD1_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYWD_HMSK*)0xFA0144B4u)
/** Alias (User Manual Name) for MCDS_TCYWD1_HMSK.
* To use register names with standard convension, please use MCDS_TCYWD1_HMSK.
*/
#define MCDS_TCYWDHMSK1 (MCDS_TCYWD1_HMSK)

