HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMcds_reg.h
/** \brief 4520, Comparator Bound Register 2 */
#define MCDS_TCYAC2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYAC_BND*)0xFA014520u)
/** Alias (User Manual Name) for MCDS_TCYAC2_BND.
* To use register names with standard convension, please use MCDS_TCYAC2_BND.
*/
#define MCDS_TCYACBND2 (MCDS_TCYAC2_BND)

/** \brief 4524, Comparator Range Register 2 */
#define MCDS_TCYAC2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYAC_RNG*)0xFA014524u)
/** Alias (User Manual Name) for MCDS_TCYAC2_RNG.
* To use register names with standard convension, please use MCDS_TCYAC2_RNG.
*/
#define MCDS_TCYACRNG2 (MCDS_TCYAC2_RNG)

/** \brief 4528, Comparator Mask Register 2 */
#define MCDS_TCYAC2_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYAC_MSK*)0xFA014528u)
/** Alias (User Manual Name) for MCDS_TCYAC2_MSK.
* To use register names with standard convension, please use MCDS_TCYAC2_MSK.
*/
#define MCDS_TCYACMSK2 (MCDS_TCYAC2_MSK)

/** \brief 4530, Comparator Bound Register 3 */
#define MCDS_TCYAC3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYAC_BND*)0xFA014530u)
/** Alias (User Manual Name) for MCDS_TCYAC3_BND.
* To use register names with standard convension, please use MCDS_TCYAC3_BND.
*/
#define MCDS_TCYACBND3 (MCDS_TCYAC3_BND)

/** \brief 4534, Comparator Range Register 3 */
#define MCDS_TCYAC3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYAC_RNG*)0xFA014534u)
/** Alias (User Manual Name) for MCDS_TCYAC3_RNG.
* To use register names with standard convension, please use MCDS_TCYAC3_RNG.
*/
#define MCDS_TCYACRNG3 (MCDS_TCYAC3_RNG)

/** \brief 4538, Comparator Mask Register 3 */
#define MCDS_TCYAC3_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYAC_MSK*)0xFA014538u)
/** Alias (User Manual Name) for MCDS_TCYAC3_MSK.
* To use register names with standard convension, please use MCDS_TCYAC3_MSK.
*/
#define MCDS_TCYACMSK3 (MCDS_TCYAC3_MSK)

/** \brief 4580, DTU FIFOs Fill Level */
#define MCDS_TCYDTUFLV /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYDTUFLV*)0xFA014580u)

/** \brief 4800, Event Definition Register 0 */
#define MCDS_TCYEVT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEVT*)0xFA014800u)

/** \brief 4804, Event Definition Register 1 */
#define MCDS_TCYEVT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEVT*)0xFA014804u)

/** \brief 4808, Event Definition Register 2 */
#define MCDS_TCYEVT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEVT*)0xFA014808u)

/** \brief 480C, Event Definition Register 3 */
#define MCDS_TCYEVT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEVT*)0xFA01480Cu)

/** \brief 4810, Event Definition Register 4 */
#define MCDS_TCYEVT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEVT*)0xFA014810u)

/** \brief 4814, Event Definition Register 5 */
#define MCDS_TCYEVT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEVT*)0xFA014814u)

/** \brief 4818, Event Definition Register 6 */
#define MCDS_TCYEVT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEVT*)0xFA014818u)

/** \brief 481C, Event Definition Register 7 */
#define MCDS_TCYEVT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEVT*)0xFA01481Cu)

/** \brief 4820, Event Definition Register 8 */
#define MCDS_TCYEVT8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEVT*)0xFA014820u)

/** \brief 4824, Event Definition Register 9 */
#define MCDS_TCYEVT9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEVT*)0xFA014824u)

/** \brief 4828, Event Definition Register 10 */
#define MCDS_TCYEVT10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEVT*)0xFA014828u)

/** \brief 482C, Event Definition Register 11 */
#define MCDS_TCYEVT11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEVT*)0xFA01482Cu)

/** \brief 4830, Event Definition Register 12 */
#define MCDS_TCYEVT12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEVT*)0xFA014830u)

/** \brief 4834, Event Definition Register 13 */
#define MCDS_TCYEVT13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEVT*)0xFA014834u)

/** \brief 4838, Event Definition Register 14 */
#define MCDS_TCYEVT14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEVT*)0xFA014838u)

/** \brief 483C, Event Definition Register 15 */
#define MCDS_TCYEVT15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYEVT*)0xFA01483Cu)

/** \brief 4880, Action Definition Register 0 */
#define MCDS_TCYACT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA014880u)

/** \brief 4884, Action Definition Register 1 */
#define MCDS_TCYACT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA014884u)

/** \brief 4888, Action Definition Register 2 */
#define MCDS_TCYACT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA014888u)

/** \brief 488C, Action Definition Register 3 */
#define MCDS_TCYACT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA01488Cu)

/** \brief 4890, Action Definition Register 4 */
#define MCDS_TCYACT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA014890u)

/** \brief 4894, Action Definition Register 5 */
#define MCDS_TCYACT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA014894u)

/** \brief 4898, Action Definition Register 6 */
#define MCDS_TCYACT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA014898u)

/** \brief 489C, Action Definition Register 7 */
#define MCDS_TCYACT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA01489Cu)

/** \brief 48A0, Action Definition Register 8 */
#define MCDS_TCYACT8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148A0u)

/** \brief 48A4, Action Definition Register 9 */
#define MCDS_TCYACT9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148A4u)

/** \brief 48A8, Action Definition Register 10 */
#define MCDS_TCYACT10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148A8u)

/** \brief 48AC, Action Definition Register 11 */
#define MCDS_TCYACT11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148ACu)

/** \brief 48B0, Action Definition Register 12 */
#define MCDS_TCYACT12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148B0u)

/** \brief 48B4, Action Definition Register 13 */
#define MCDS_TCYACT13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148B4u)

