HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMcds_reg.h
/** \brief 48B8, Action Definition Register 14 */
#define MCDS_TCYACT14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148B8u)

/** \brief 48BC, Action Definition Register 15 */
#define MCDS_TCYACT15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148BCu)

/** \brief 48C0, Action Definition Register 16 */
#define MCDS_TCYACT16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148C0u)

/** \brief 48C4, Action Definition Register 17 */
#define MCDS_TCYACT17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148C4u)

/** \brief 48C8, Action Definition Register 18 */
#define MCDS_TCYACT18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148C8u)

/** \brief 48CC, Action Definition Register 19 */
#define MCDS_TCYACT19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148CCu)

/** \brief 48D0, Action Definition Register 20 */
#define MCDS_TCYACT20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148D0u)

/** \brief 48D4, Action Definition Register 21 */
#define MCDS_TCYACT21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148D4u)

/** \brief 48D8, Action Definition Register 22 */
#define MCDS_TCYACT22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148D8u)

/** \brief 48DC, Action Definition Register 23 */
#define MCDS_TCYACT23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYACT*)0xFA0148DCu)

/** \brief 4C00, Comparator Bound Register 0 */
#define MCDS_TCYID0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYID_BND*)0xFA014C00u)
/** Alias (User Manual Name) for MCDS_TCYID0_BND.
* To use register names with standard convension, please use MCDS_TCYID0_BND.
*/
#define MCDS_TCYIDBND0 (MCDS_TCYID0_BND)

/** \brief 4C04, Comparator Range Register 0 */
#define MCDS_TCYID0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYID_RNG*)0xFA014C04u)
/** Alias (User Manual Name) for MCDS_TCYID0_RNG.
* To use register names with standard convension, please use MCDS_TCYID0_RNG.
*/
#define MCDS_TCYIDRNG0 (MCDS_TCYID0_RNG)

/** \brief 4C08, Comparator Mask Register 0 */
#define MCDS_TCYID0_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYID_MSK*)0xFA014C08u)
/** Alias (User Manual Name) for MCDS_TCYID0_MSK.
* To use register names with standard convension, please use MCDS_TCYID0_MSK.
*/
#define MCDS_TCYIDMSK0 (MCDS_TCYID0_MSK)

/** \brief 4C0C, Comparator Sign Register 0 */
#define MCDS_TCYID0_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYID_SGN*)0xFA014C0Cu)
/** Alias (User Manual Name) for MCDS_TCYID0_SGN.
* To use register names with standard convension, please use MCDS_TCYID0_SGN.
*/
#define MCDS_TCYIDSGN0 (MCDS_TCYID0_SGN)

/** \brief 4C10, Comparator Bound Register 1 */
#define MCDS_TCYID1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYID_BND*)0xFA014C10u)
/** Alias (User Manual Name) for MCDS_TCYID1_BND.
* To use register names with standard convension, please use MCDS_TCYID1_BND.
*/
#define MCDS_TCYIDBND1 (MCDS_TCYID1_BND)

/** \brief 4C14, Comparator Range Register 1 */
#define MCDS_TCYID1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYID_RNG*)0xFA014C14u)
/** Alias (User Manual Name) for MCDS_TCYID1_RNG.
* To use register names with standard convension, please use MCDS_TCYID1_RNG.
*/
#define MCDS_TCYIDRNG1 (MCDS_TCYID1_RNG)

/** \brief 4C18, Comparator Mask Register 1 */
#define MCDS_TCYID1_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYID_MSK*)0xFA014C18u)
/** Alias (User Manual Name) for MCDS_TCYID1_MSK.
* To use register names with standard convension, please use MCDS_TCYID1_MSK.
*/
#define MCDS_TCYIDMSK1 (MCDS_TCYID1_MSK)

/** \brief 4C1C, Comparator Sign Register 1 */
#define MCDS_TCYID1_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYID_SGN*)0xFA014C1Cu)
/** Alias (User Manual Name) for MCDS_TCYID1_SGN.
* To use register names with standard convension, please use MCDS_TCYID1_SGN.
*/
#define MCDS_TCYIDSGN1 (MCDS_TCYID1_SGN)

/** \brief 5000, Comparator Bound Register 0 */
#define MCDS_TCYIP0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYIP_BND*)0xFA015000u)
/** Alias (User Manual Name) for MCDS_TCYIP0_BND.
* To use register names with standard convension, please use MCDS_TCYIP0_BND.
*/
#define MCDS_TCYIPBND0 (MCDS_TCYIP0_BND)

/** \brief 5004, Comparator Range Register 0 */
#define MCDS_TCYIP0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYIP_RNG*)0xFA015004u)
/** Alias (User Manual Name) for MCDS_TCYIP0_RNG.
* To use register names with standard convension, please use MCDS_TCYIP0_RNG.
*/
#define MCDS_TCYIPRNG0 (MCDS_TCYIP0_RNG)

/** \brief 5010, Comparator Bound Register 1 */
#define MCDS_TCYIP1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYIP_BND*)0xFA015010u)
/** Alias (User Manual Name) for MCDS_TCYIP1_BND.
* To use register names with standard convension, please use MCDS_TCYIP1_BND.
*/
#define MCDS_TCYIPBND1 (MCDS_TCYIP1_BND)

/** \brief 5014, Comparator Range Register 1 */
#define MCDS_TCYIP1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYIP_RNG*)0xFA015014u)
/** Alias (User Manual Name) for MCDS_TCYIP1_RNG.
* To use register names with standard convension, please use MCDS_TCYIP1_RNG.
*/
#define MCDS_TCYIPRNG1 (MCDS_TCYIP1_RNG)

/** \brief 5020, Comparator Bound Register 2 */
#define MCDS_TCYIP2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYIP_BND*)0xFA015020u)
/** Alias (User Manual Name) for MCDS_TCYIP2_BND.
* To use register names with standard convension, please use MCDS_TCYIP2_BND.
*/
#define MCDS_TCYIPBND2 (MCDS_TCYIP2_BND)

/** \brief 5024, Comparator Range Register 2 */
#define MCDS_TCYIP2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYIP_RNG*)0xFA015024u)
/** Alias (User Manual Name) for MCDS_TCYIP2_RNG.
* To use register names with standard convension, please use MCDS_TCYIP2_RNG.
*/
#define MCDS_TCYIPRNG2 (MCDS_TCYIP2_RNG)

/** \brief 5030, Comparator Bound Register 3 */
#define MCDS_TCYIP3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYIP_BND*)0xFA015030u)
/** Alias (User Manual Name) for MCDS_TCYIP3_BND.
* To use register names with standard convension, please use MCDS_TCYIP3_BND.
*/
#define MCDS_TCYIPBND3 (MCDS_TCYIP3_BND)

/** \brief 5034, Comparator Range Register 3 */
#define MCDS_TCYIP3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYIP_RNG*)0xFA015034u)
/** Alias (User Manual Name) for MCDS_TCYIP3_RNG.
* To use register names with standard convension, please use MCDS_TCYIP3_RNG.
*/
#define MCDS_TCYIPRNG3 (MCDS_TCYIP3_RNG)

/** \brief 5040, Comparator Bound Register 4 */
#define MCDS_TCYIP4_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYIP_BND*)0xFA015040u)
/** Alias (User Manual Name) for MCDS_TCYIP4_BND.
* To use register names with standard convension, please use MCDS_TCYIP4_BND.
*/
#define MCDS_TCYIPBND4 (MCDS_TCYIP4_BND)

/** \brief 5044, Comparator Range Register 4 */
#define MCDS_TCYIP4_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYIP_RNG*)0xFA015044u)
/** Alias (User Manual Name) for MCDS_TCYIP4_RNG.
* To use register names with standard convension, please use MCDS_TCYIP4_RNG.
*/
#define MCDS_TCYIPRNG4 (MCDS_TCYIP4_RNG)

