HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMcds_reg.h
/** \brief 5050, Comparator Bound Register 5 */
#define MCDS_TCYIP5_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYIP_BND*)0xFA015050u)
/** Alias (User Manual Name) for MCDS_TCYIP5_BND.
* To use register names with standard convension, please use MCDS_TCYIP5_BND.
*/
#define MCDS_TCYIPBND5 (MCDS_TCYIP5_BND)

/** \brief 5054, Comparator Range Register 5 */
#define MCDS_TCYIP5_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYIP_RNG*)0xFA015054u)
/** Alias (User Manual Name) for MCDS_TCYIP5_RNG.
* To use register names with standard convension, please use MCDS_TCYIP5_RNG.
*/
#define MCDS_TCYIPRNG5 (MCDS_TCYIP5_RNG)

/** \brief 6000, Debug Status Register */
#define MCDS_SPBDCSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBDCSTS*)0xFA016000u)

/** \brief 6400, Comparator Bound Register 0 */
#define MCDS_SPBEA0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEA_BND*)0xFA016400u)
/** Alias (User Manual Name) for MCDS_SPBEA0_BND.
* To use register names with standard convension, please use MCDS_SPBEA0_BND.
*/
#define MCDS_SPBEABND0 (MCDS_SPBEA0_BND)

/** \brief 6404, Comparator Range Register 0 */
#define MCDS_SPBEA0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEA_RNG*)0xFA016404u)
/** Alias (User Manual Name) for MCDS_SPBEA0_RNG.
* To use register names with standard convension, please use MCDS_SPBEA0_RNG.
*/
#define MCDS_SPBEARNG0 (MCDS_SPBEA0_RNG)

/** \brief 6410, Comparator Bound Register 1 */
#define MCDS_SPBEA1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEA_BND*)0xFA016410u)
/** Alias (User Manual Name) for MCDS_SPBEA1_BND.
* To use register names with standard convension, please use MCDS_SPBEA1_BND.
*/
#define MCDS_SPBEABND1 (MCDS_SPBEA1_BND)

/** \brief 6414, Comparator Range Register 1 */
#define MCDS_SPBEA1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEA_RNG*)0xFA016414u)
/** Alias (User Manual Name) for MCDS_SPBEA1_RNG.
* To use register names with standard convension, please use MCDS_SPBEA1_RNG.
*/
#define MCDS_SPBEARNG1 (MCDS_SPBEA1_RNG)

/** \brief 6420, Comparator Bound Register 2 */
#define MCDS_SPBEA2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEA_BND*)0xFA016420u)
/** Alias (User Manual Name) for MCDS_SPBEA2_BND.
* To use register names with standard convension, please use MCDS_SPBEA2_BND.
*/
#define MCDS_SPBEABND2 (MCDS_SPBEA2_BND)

/** \brief 6424, Comparator Range Register 2 */
#define MCDS_SPBEA2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEA_RNG*)0xFA016424u)
/** Alias (User Manual Name) for MCDS_SPBEA2_RNG.
* To use register names with standard convension, please use MCDS_SPBEA2_RNG.
*/
#define MCDS_SPBEARNG2 (MCDS_SPBEA2_RNG)

/** \brief 6430, Comparator Bound Register 3 */
#define MCDS_SPBEA3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEA_BND*)0xFA016430u)
/** Alias (User Manual Name) for MCDS_SPBEA3_BND.
* To use register names with standard convension, please use MCDS_SPBEA3_BND.
*/
#define MCDS_SPBEABND3 (MCDS_SPBEA3_BND)

/** \brief 6434, Comparator Range Register 3 */
#define MCDS_SPBEA3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEA_RNG*)0xFA016434u)
/** Alias (User Manual Name) for MCDS_SPBEA3_RNG.
* To use register names with standard convension, please use MCDS_SPBEA3_RNG.
*/
#define MCDS_SPBEARNG3 (MCDS_SPBEA3_RNG)

/** \brief 6480, Comparator Bound Register 0 */
#define MCDS_SPBWD0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_BND*)0xFA016480u)
/** Alias (User Manual Name) for MCDS_SPBWD0_BND.
* To use register names with standard convension, please use MCDS_SPBWD0_BND.
*/
#define MCDS_SPBWDBND0 (MCDS_SPBWD0_BND)

/** \brief 6484, Comparator Range Register 0 */
#define MCDS_SPBWD0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_RNG*)0xFA016484u)
/** Alias (User Manual Name) for MCDS_SPBWD0_RNG.
* To use register names with standard convension, please use MCDS_SPBWD0_RNG.
*/
#define MCDS_SPBWDRNG0 (MCDS_SPBWD0_RNG)

/** \brief 6488, Comparator Mask Register 0 */
#define MCDS_SPBWD0_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_MSK*)0xFA016488u)
/** Alias (User Manual Name) for MCDS_SPBWD0_MSK.
* To use register names with standard convension, please use MCDS_SPBWD0_MSK.
*/
#define MCDS_SPBWDMSK0 (MCDS_SPBWD0_MSK)

/** \brief 648C, Comparator Sign Register 0 */
#define MCDS_SPBWD0_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_SGN*)0xFA01648Cu)
/** Alias (User Manual Name) for MCDS_SPBWD0_SGN.
* To use register names with standard convension, please use MCDS_SPBWD0_SGN.
*/
#define MCDS_SPBWDSGN0 (MCDS_SPBWD0_SGN)

/** \brief 6490, Comparator Bound Register 1 */
#define MCDS_SPBWD1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_BND*)0xFA016490u)
/** Alias (User Manual Name) for MCDS_SPBWD1_BND.
* To use register names with standard convension, please use MCDS_SPBWD1_BND.
*/
#define MCDS_SPBWDBND1 (MCDS_SPBWD1_BND)

/** \brief 6494, Comparator Range Register 1 */
#define MCDS_SPBWD1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_RNG*)0xFA016494u)
/** Alias (User Manual Name) for MCDS_SPBWD1_RNG.
* To use register names with standard convension, please use MCDS_SPBWD1_RNG.
*/
#define MCDS_SPBWDRNG1 (MCDS_SPBWD1_RNG)

/** \brief 6498, Comparator Mask Register 1 */
#define MCDS_SPBWD1_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_MSK*)0xFA016498u)
/** Alias (User Manual Name) for MCDS_SPBWD1_MSK.
* To use register names with standard convension, please use MCDS_SPBWD1_MSK.
*/
#define MCDS_SPBWDMSK1 (MCDS_SPBWD1_MSK)

/** \brief 649C, Comparator Sign Register 1 */
#define MCDS_SPBWD1_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_SGN*)0xFA01649Cu)
/** Alias (User Manual Name) for MCDS_SPBWD1_SGN.
* To use register names with standard convension, please use MCDS_SPBWD1_SGN.
*/
#define MCDS_SPBWDSGN1 (MCDS_SPBWD1_SGN)

/** \brief 64A0, Comparator Bound Register 2 */
#define MCDS_SPBWD2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_BND*)0xFA0164A0u)
/** Alias (User Manual Name) for MCDS_SPBWD2_BND.
* To use register names with standard convension, please use MCDS_SPBWD2_BND.
*/
#define MCDS_SPBWDBND2 (MCDS_SPBWD2_BND)

/** \brief 64A4, Comparator Range Register 2 */
#define MCDS_SPBWD2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_RNG*)0xFA0164A4u)
/** Alias (User Manual Name) for MCDS_SPBWD2_RNG.
* To use register names with standard convension, please use MCDS_SPBWD2_RNG.
*/
#define MCDS_SPBWDRNG2 (MCDS_SPBWD2_RNG)

/** \brief 64A8, Comparator Mask Register 2 */
#define MCDS_SPBWD2_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_MSK*)0xFA0164A8u)
/** Alias (User Manual Name) for MCDS_SPBWD2_MSK.
* To use register names with standard convension, please use MCDS_SPBWD2_MSK.
*/
#define MCDS_SPBWDMSK2 (MCDS_SPBWD2_MSK)

/** \brief 64AC, Comparator Sign Register 2 */
#define MCDS_SPBWD2_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_SGN*)0xFA0164ACu)
/** Alias (User Manual Name) for MCDS_SPBWD2_SGN.
* To use register names with standard convension, please use MCDS_SPBWD2_SGN.
*/
#define MCDS_SPBWDSGN2 (MCDS_SPBWD2_SGN)

/** \brief 64B0, Comparator Bound Register 3 */
#define MCDS_SPBWD3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_BND*)0xFA0164B0u)
/** Alias (User Manual Name) for MCDS_SPBWD3_BND.
* To use register names with standard convension, please use MCDS_SPBWD3_BND.
*/
#define MCDS_SPBWDBND3 (MCDS_SPBWD3_BND)

/** \brief 64B4, Comparator Range Register 3 */
#define MCDS_SPBWD3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_RNG*)0xFA0164B4u)
/** Alias (User Manual Name) for MCDS_SPBWD3_RNG.
* To use register names with standard convension, please use MCDS_SPBWD3_RNG.
*/
#define MCDS_SPBWDRNG3 (MCDS_SPBWD3_RNG)

/** \brief 64B8, Comparator Mask Register 3 */
#define MCDS_SPBWD3_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_MSK*)0xFA0164B8u)
/** Alias (User Manual Name) for MCDS_SPBWD3_MSK.
* To use register names with standard convension, please use MCDS_SPBWD3_MSK.
*/
#define MCDS_SPBWDMSK3 (MCDS_SPBWD3_MSK)

/** \brief 64BC, Comparator Sign Register 3 */
#define MCDS_SPBWD3_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_SGN*)0xFA0164BCu)
/** Alias (User Manual Name) for MCDS_SPBWD3_SGN.
* To use register names with standard convension, please use MCDS_SPBWD3_SGN.
*/
#define MCDS_SPBWDSGN3 (MCDS_SPBWD3_SGN)

