HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMcds_reg.h
/** \brief 6500, Comparator Bound Register 0 */
#define MCDS_SPBAC0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBAC_BND*)0xFA016500u)
/** Alias (User Manual Name) for MCDS_SPBAC0_BND.
* To use register names with standard convension, please use MCDS_SPBAC0_BND.
*/
#define MCDS_SPBACBND0 (MCDS_SPBAC0_BND)

/** \brief 6504, Comparator Range Register 0 */
#define MCDS_SPBAC0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBAC_RNG*)0xFA016504u)
/** Alias (User Manual Name) for MCDS_SPBAC0_RNG.
* To use register names with standard convension, please use MCDS_SPBAC0_RNG.
*/
#define MCDS_SPBACRNG0 (MCDS_SPBAC0_RNG)

/** \brief 6508, Comparator Mask Register 0 */
#define MCDS_SPBAC0_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBAC_MSK*)0xFA016508u)
/** Alias (User Manual Name) for MCDS_SPBAC0_MSK.
* To use register names with standard convension, please use MCDS_SPBAC0_MSK.
*/
#define MCDS_SPBACMSK0 (MCDS_SPBAC0_MSK)

/** \brief 6510, Comparator Bound Register 1 */
#define MCDS_SPBAC1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBAC_BND*)0xFA016510u)
/** Alias (User Manual Name) for MCDS_SPBAC1_BND.
* To use register names with standard convension, please use MCDS_SPBAC1_BND.
*/
#define MCDS_SPBACBND1 (MCDS_SPBAC1_BND)

/** \brief 6514, Comparator Range Register 1 */
#define MCDS_SPBAC1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBAC_RNG*)0xFA016514u)
/** Alias (User Manual Name) for MCDS_SPBAC1_RNG.
* To use register names with standard convension, please use MCDS_SPBAC1_RNG.
*/
#define MCDS_SPBACRNG1 (MCDS_SPBAC1_RNG)

/** \brief 6518, Comparator Mask Register 1 */
#define MCDS_SPBAC1_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBAC_MSK*)0xFA016518u)
/** Alias (User Manual Name) for MCDS_SPBAC1_MSK.
* To use register names with standard convension, please use MCDS_SPBAC1_MSK.
*/
#define MCDS_SPBACMSK1 (MCDS_SPBAC1_MSK)

/** \brief 6520, Comparator Bound Register 2 */
#define MCDS_SPBAC2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBAC_BND*)0xFA016520u)
/** Alias (User Manual Name) for MCDS_SPBAC2_BND.
* To use register names with standard convension, please use MCDS_SPBAC2_BND.
*/
#define MCDS_SPBACBND2 (MCDS_SPBAC2_BND)

/** \brief 6524, Comparator Range Register 2 */
#define MCDS_SPBAC2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBAC_RNG*)0xFA016524u)
/** Alias (User Manual Name) for MCDS_SPBAC2_RNG.
* To use register names with standard convension, please use MCDS_SPBAC2_RNG.
*/
#define MCDS_SPBACRNG2 (MCDS_SPBAC2_RNG)

/** \brief 6528, Comparator Mask Register 2 */
#define MCDS_SPBAC2_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBAC_MSK*)0xFA016528u)
/** Alias (User Manual Name) for MCDS_SPBAC2_MSK.
* To use register names with standard convension, please use MCDS_SPBAC2_MSK.
*/
#define MCDS_SPBACMSK2 (MCDS_SPBAC2_MSK)

/** \brief 6530, Comparator Bound Register 3 */
#define MCDS_SPBAC3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBAC_BND*)0xFA016530u)
/** Alias (User Manual Name) for MCDS_SPBAC3_BND.
* To use register names with standard convension, please use MCDS_SPBAC3_BND.
*/
#define MCDS_SPBACBND3 (MCDS_SPBAC3_BND)

/** \brief 6534, Comparator Range Register 3 */
#define MCDS_SPBAC3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBAC_RNG*)0xFA016534u)
/** Alias (User Manual Name) for MCDS_SPBAC3_RNG.
* To use register names with standard convension, please use MCDS_SPBAC3_RNG.
*/
#define MCDS_SPBACRNG3 (MCDS_SPBAC3_RNG)

/** \brief 6538, Comparator Mask Register 3 */
#define MCDS_SPBAC3_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBAC_MSK*)0xFA016538u)
/** Alias (User Manual Name) for MCDS_SPBAC3_MSK.
* To use register names with standard convension, please use MCDS_SPBAC3_MSK.
*/
#define MCDS_SPBACMSK3 (MCDS_SPBAC3_MSK)

/** \brief 6800, Event Definition Register 0 */
#define MCDS_SPBEVT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA016800u)

/** \brief 6804, Event Definition Register 1 */
#define MCDS_SPBEVT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA016804u)

/** \brief 6808, Event Definition Register 2 */
#define MCDS_SPBEVT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA016808u)

/** \brief 680C, Event Definition Register 3 */
#define MCDS_SPBEVT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA01680Cu)

/** \brief 6810, Event Definition Register 4 */
#define MCDS_SPBEVT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA016810u)

/** \brief 6814, Event Definition Register 5 */
#define MCDS_SPBEVT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA016814u)

/** \brief 6818, Event Definition Register 6 */
#define MCDS_SPBEVT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA016818u)

/** \brief 681C, Event Definition Register 7 */
#define MCDS_SPBEVT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA01681Cu)

/** \brief 6820, Event Definition Register 8 */
#define MCDS_SPBEVT8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA016820u)

/** \brief 6824, Event Definition Register 9 */
#define MCDS_SPBEVT9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA016824u)

/** \brief 6828, Event Definition Register 10 */
#define MCDS_SPBEVT10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA016828u)

/** \brief 682C, Event Definition Register 11 */
#define MCDS_SPBEVT11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA01682Cu)

/** \brief 6830, Event Definition Register 12 */
#define MCDS_SPBEVT12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA016830u)

/** \brief 6834, Event Definition Register 13 */
#define MCDS_SPBEVT13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA016834u)

/** \brief 6838, Event Definition Register 14 */
#define MCDS_SPBEVT14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA016838u)

/** \brief 683C, Event Definition Register 15 */
#define MCDS_SPBEVT15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEVT*)0xFA01683Cu)

/** \brief 6880, Action Definition Register 0 */
#define MCDS_SPBACT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBACT*)0xFA016880u)

/** \brief 6884, Action Definition Register 1 */
#define MCDS_SPBACT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBACT*)0xFA016884u)

/** \brief 6888, Action Definition Register 2 */
#define MCDS_SPBACT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBACT*)0xFA016888u)

/** \brief 688C, Action Definition Register 3 */
#define MCDS_SPBACT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBACT*)0xFA01688Cu)

