HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMcds_reg.h
/** \brief 6890, Action Definition Register 4 */
#define MCDS_SPBACT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBACT*)0xFA016890u)

/** \brief 6894, Action Definition Register 5 */
#define MCDS_SPBACT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBACT*)0xFA016894u)

/** \brief 6898, Action Definition Register 6 */
#define MCDS_SPBACT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBACT*)0xFA016898u)

/** \brief 689C, Action Definition Register 7 */
#define MCDS_SPBACT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBACT*)0xFA01689Cu)

/** \brief 68A0, Action Definition Register 8 */
#define MCDS_SPBACT8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBACT*)0xFA0168A0u)

/** \brief 68A4, Action Definition Register 9 */
#define MCDS_SPBACT9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBACT*)0xFA0168A4u)

/** \brief 68A8, Action Definition Register 10 */
#define MCDS_SPBACT10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBACT*)0xFA0168A8u)

/** \brief 68AC, Action Definition Register 11 */
#define MCDS_SPBACT11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBACT*)0xFA0168ACu)

/** \brief 68B0, Action Definition Register 12 */
#define MCDS_SPBACT12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBACT*)0xFA0168B0u)

/** \brief 68B4, Action Definition Register 13 */
#define MCDS_SPBACT13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBACT*)0xFA0168B4u)

/** \brief 68B8, Action Definition Register 14 */
#define MCDS_SPBACT14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBACT*)0xFA0168B8u)

/** \brief 7000, Debug Status Register */
#define MCDS_SRIDCSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIDCSTS*)0xFA017000u)

/** \brief 7200, Lookup Table Data Register */
#define MCDS_SRI1BALLUTD /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1BALLUTD*)0xFA017200u)

/** \brief 7204, Lookup Table Address Register */
#define MCDS_SRI1BALLUTA /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1BALLUTA*)0xFA017204u)

/** \brief 7210, Lookup Table Base Register */
#define MCDS_SRI1BAL0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1BAL_BND*)0xFA017210u)
/** Alias (User Manual Name) for MCDS_SRI1BAL0_BND.
* To use register names with standard convension, please use MCDS_SRI1BAL0_BND.
*/
#define MCDS_SRI1BALBND0 (MCDS_SRI1BAL0_BND)

/** \brief 7214, Lookup Table Range Register */
#define MCDS_SRI1BAL0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1BAL_RNG*)0xFA017214u)
/** Alias (User Manual Name) for MCDS_SRI1BAL0_RNG.
* To use register names with standard convension, please use MCDS_SRI1BAL0_RNG.
*/
#define MCDS_SRI1BALRNG0 (MCDS_SRI1BAL0_RNG)

/** \brief 7218, Lookup Table Mapping Register */
#define MCDS_SRI1BAL0_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1BAL_MAP*)0xFA017218u)
/** Alias (User Manual Name) for MCDS_SRI1BAL0_MAP.
* To use register names with standard convension, please use MCDS_SRI1BAL0_MAP.
*/
#define MCDS_SRI1BALMAP0 (MCDS_SRI1BAL0_MAP)

/** \brief 7220, Lookup Table Base Register */
#define MCDS_SRI1BAL1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1BAL_BND*)0xFA017220u)
/** Alias (User Manual Name) for MCDS_SRI1BAL1_BND.
* To use register names with standard convension, please use MCDS_SRI1BAL1_BND.
*/
#define MCDS_SRI1BALBND1 (MCDS_SRI1BAL1_BND)

/** \brief 7224, Lookup Table Range Register */
#define MCDS_SRI1BAL1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1BAL_RNG*)0xFA017224u)
/** Alias (User Manual Name) for MCDS_SRI1BAL1_RNG.
* To use register names with standard convension, please use MCDS_SRI1BAL1_RNG.
*/
#define MCDS_SRI1BALRNG1 (MCDS_SRI1BAL1_RNG)

/** \brief 7228, Lookup Table Mapping Register */
#define MCDS_SRI1BAL1_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1BAL_MAP*)0xFA017228u)
/** Alias (User Manual Name) for MCDS_SRI1BAL1_MAP.
* To use register names with standard convension, please use MCDS_SRI1BAL1_MAP.
*/
#define MCDS_SRI1BALMAP1 (MCDS_SRI1BAL1_MAP)

/** \brief 7230, Lookup Table Base Register */
#define MCDS_SRI1BAL2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1BAL_BND*)0xFA017230u)
/** Alias (User Manual Name) for MCDS_SRI1BAL2_BND.
* To use register names with standard convension, please use MCDS_SRI1BAL2_BND.
*/
#define MCDS_SRI1BALBND2 (MCDS_SRI1BAL2_BND)

/** \brief 7234, Lookup Table Range Register */
#define MCDS_SRI1BAL2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1BAL_RNG*)0xFA017234u)
/** Alias (User Manual Name) for MCDS_SRI1BAL2_RNG.
* To use register names with standard convension, please use MCDS_SRI1BAL2_RNG.
*/
#define MCDS_SRI1BALRNG2 (MCDS_SRI1BAL2_RNG)

/** \brief 7238, Lookup Table Mapping Register */
#define MCDS_SRI1BAL2_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1BAL_MAP*)0xFA017238u)
/** Alias (User Manual Name) for MCDS_SRI1BAL2_MAP.
* To use register names with standard convension, please use MCDS_SRI1BAL2_MAP.
*/
#define MCDS_SRI1BALMAP2 (MCDS_SRI1BAL2_MAP)

/** \brief 7240, Lookup Table Base Register */
#define MCDS_SRI1BAL3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1BAL_BND*)0xFA017240u)
/** Alias (User Manual Name) for MCDS_SRI1BAL3_BND.
* To use register names with standard convension, please use MCDS_SRI1BAL3_BND.
*/
#define MCDS_SRI1BALBND3 (MCDS_SRI1BAL3_BND)

/** \brief 7244, Lookup Table Range Register */
#define MCDS_SRI1BAL3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1BAL_RNG*)0xFA017244u)
/** Alias (User Manual Name) for MCDS_SRI1BAL3_RNG.
* To use register names with standard convension, please use MCDS_SRI1BAL3_RNG.
*/
#define MCDS_SRI1BALRNG3 (MCDS_SRI1BAL3_RNG)

/** \brief 7248, Lookup Table Mapping Register */
#define MCDS_SRI1BAL3_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1BAL_MAP*)0xFA017248u)
/** Alias (User Manual Name) for MCDS_SRI1BAL3_MAP.
* To use register names with standard convension, please use MCDS_SRI1BAL3_MAP.
*/
#define MCDS_SRI1BALMAP3 (MCDS_SRI1BAL3_MAP)

/** \brief 7300, Lookup Table Data Register */
#define MCDS_SRI2BALLUTD /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2BALLUTD*)0xFA017300u)

/** \brief 7304, Lookup Table Address Register */
#define MCDS_SRI2BALLUTA /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2BALLUTA*)0xFA017304u)

/** \brief 7310, Lookup Table Base Register */
#define MCDS_SRI2BAL0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2BAL_BND*)0xFA017310u)
/** Alias (User Manual Name) for MCDS_SRI2BAL0_BND.
* To use register names with standard convension, please use MCDS_SRI2BAL0_BND.
*/
#define MCDS_SRI2BALBND0 (MCDS_SRI2BAL0_BND)

/** \brief 7314, Lookup Table Range Register */
#define MCDS_SRI2BAL0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2BAL_RNG*)0xFA017314u)
/** Alias (User Manual Name) for MCDS_SRI2BAL0_RNG.
* To use register names with standard convension, please use MCDS_SRI2BAL0_RNG.
*/
#define MCDS_SRI2BALRNG0 (MCDS_SRI2BAL0_RNG)

/** \brief 7318, Lookup Table Mapping Register */
#define MCDS_SRI2BAL0_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2BAL_MAP*)0xFA017318u)
/** Alias (User Manual Name) for MCDS_SRI2BAL0_MAP.
* To use register names with standard convension, please use MCDS_SRI2BAL0_MAP.
*/
#define MCDS_SRI2BALMAP0 (MCDS_SRI2BAL0_MAP)

/** \brief 7320, Lookup Table Base Register */
#define MCDS_SRI2BAL1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2BAL_BND*)0xFA017320u)
/** Alias (User Manual Name) for MCDS_SRI2BAL1_BND.
* To use register names with standard convension, please use MCDS_SRI2BAL1_BND.
*/
#define MCDS_SRI2BALBND1 (MCDS_SRI2BAL1_BND)

