HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMcds_reg.h
/** \brief 7324, Lookup Table Range Register */
#define MCDS_SRI2BAL1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2BAL_RNG*)0xFA017324u)
/** Alias (User Manual Name) for MCDS_SRI2BAL1_RNG.
* To use register names with standard convension, please use MCDS_SRI2BAL1_RNG.
*/
#define MCDS_SRI2BALRNG1 (MCDS_SRI2BAL1_RNG)

/** \brief 7328, Lookup Table Mapping Register */
#define MCDS_SRI2BAL1_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2BAL_MAP*)0xFA017328u)
/** Alias (User Manual Name) for MCDS_SRI2BAL1_MAP.
* To use register names with standard convension, please use MCDS_SRI2BAL1_MAP.
*/
#define MCDS_SRI2BALMAP1 (MCDS_SRI2BAL1_MAP)

/** \brief 7330, Lookup Table Base Register */
#define MCDS_SRI2BAL2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2BAL_BND*)0xFA017330u)
/** Alias (User Manual Name) for MCDS_SRI2BAL2_BND.
* To use register names with standard convension, please use MCDS_SRI2BAL2_BND.
*/
#define MCDS_SRI2BALBND2 (MCDS_SRI2BAL2_BND)

/** \brief 7334, Lookup Table Range Register */
#define MCDS_SRI2BAL2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2BAL_RNG*)0xFA017334u)
/** Alias (User Manual Name) for MCDS_SRI2BAL2_RNG.
* To use register names with standard convension, please use MCDS_SRI2BAL2_RNG.
*/
#define MCDS_SRI2BALRNG2 (MCDS_SRI2BAL2_RNG)

/** \brief 7338, Lookup Table Mapping Register */
#define MCDS_SRI2BAL2_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2BAL_MAP*)0xFA017338u)
/** Alias (User Manual Name) for MCDS_SRI2BAL2_MAP.
* To use register names with standard convension, please use MCDS_SRI2BAL2_MAP.
*/
#define MCDS_SRI2BALMAP2 (MCDS_SRI2BAL2_MAP)

/** \brief 7340, Lookup Table Base Register */
#define MCDS_SRI2BAL3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2BAL_BND*)0xFA017340u)
/** Alias (User Manual Name) for MCDS_SRI2BAL3_BND.
* To use register names with standard convension, please use MCDS_SRI2BAL3_BND.
*/
#define MCDS_SRI2BALBND3 (MCDS_SRI2BAL3_BND)

/** \brief 7344, Lookup Table Range Register */
#define MCDS_SRI2BAL3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2BAL_RNG*)0xFA017344u)
/** Alias (User Manual Name) for MCDS_SRI2BAL3_RNG.
* To use register names with standard convension, please use MCDS_SRI2BAL3_RNG.
*/
#define MCDS_SRI2BALRNG3 (MCDS_SRI2BAL3_RNG)

/** \brief 7348, Lookup Table Mapping Register */
#define MCDS_SRI2BAL3_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2BAL_MAP*)0xFA017348u)
/** Alias (User Manual Name) for MCDS_SRI2BAL3_MAP.
* To use register names with standard convension, please use MCDS_SRI2BAL3_MAP.
*/
#define MCDS_SRI2BALMAP3 (MCDS_SRI2BAL3_MAP)

/** \brief 7400, Comparator Bound Register 0 */
#define MCDS_SRI1EA0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1EA_BND*)0xFA017400u)
/** Alias (User Manual Name) for MCDS_SRI1EA0_BND.
* To use register names with standard convension, please use MCDS_SRI1EA0_BND.
*/
#define MCDS_SRI1EABND0 (MCDS_SRI1EA0_BND)

/** \brief 7404, Comparator Range Register 0 */
#define MCDS_SRI1EA0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1EA_RNG*)0xFA017404u)
/** Alias (User Manual Name) for MCDS_SRI1EA0_RNG.
* To use register names with standard convension, please use MCDS_SRI1EA0_RNG.
*/
#define MCDS_SRI1EARNG0 (MCDS_SRI1EA0_RNG)

/** \brief 7410, Comparator Bound Register 1 */
#define MCDS_SRI1EA1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1EA_BND*)0xFA017410u)
/** Alias (User Manual Name) for MCDS_SRI1EA1_BND.
* To use register names with standard convension, please use MCDS_SRI1EA1_BND.
*/
#define MCDS_SRI1EABND1 (MCDS_SRI1EA1_BND)

/** \brief 7414, Comparator Range Register 1 */
#define MCDS_SRI1EA1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1EA_RNG*)0xFA017414u)
/** Alias (User Manual Name) for MCDS_SRI1EA1_RNG.
* To use register names with standard convension, please use MCDS_SRI1EA1_RNG.
*/
#define MCDS_SRI1EARNG1 (MCDS_SRI1EA1_RNG)

/** \brief 7420, Comparator Bound Register 2 */
#define MCDS_SRI1EA2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1EA_BND*)0xFA017420u)
/** Alias (User Manual Name) for MCDS_SRI1EA2_BND.
* To use register names with standard convension, please use MCDS_SRI1EA2_BND.
*/
#define MCDS_SRI1EABND2 (MCDS_SRI1EA2_BND)

/** \brief 7424, Comparator Range Register 2 */
#define MCDS_SRI1EA2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1EA_RNG*)0xFA017424u)
/** Alias (User Manual Name) for MCDS_SRI1EA2_RNG.
* To use register names with standard convension, please use MCDS_SRI1EA2_RNG.
*/
#define MCDS_SRI1EARNG2 (MCDS_SRI1EA2_RNG)

/** \brief 7430, Comparator Bound Register 3 */
#define MCDS_SRI1EA3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1EA_BND*)0xFA017430u)
/** Alias (User Manual Name) for MCDS_SRI1EA3_BND.
* To use register names with standard convension, please use MCDS_SRI1EA3_BND.
*/
#define MCDS_SRI1EABND3 (MCDS_SRI1EA3_BND)

/** \brief 7434, Comparator Range Register 3 */
#define MCDS_SRI1EA3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1EA_RNG*)0xFA017434u)
/** Alias (User Manual Name) for MCDS_SRI1EA3_RNG.
* To use register names with standard convension, please use MCDS_SRI1EA3_RNG.
*/
#define MCDS_SRI1EARNG3 (MCDS_SRI1EA3_RNG)

/** \brief 7480, Comparator Bound Register 0 */
#define MCDS_SRI1WD0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_BND*)0xFA017480u)
/** Alias (User Manual Name) for MCDS_SRI1WD0_BND.
* To use register names with standard convension, please use MCDS_SRI1WD0_BND.
*/
#define MCDS_SRI1WDBND0 (MCDS_SRI1WD0_BND)

/** \brief 7484, Comparator Bound Register 0 */
#define MCDS_SRI1WD0_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_HBND*)0xFA017484u)
/** Alias (User Manual Name) for MCDS_SRI1WD0_HBND.
* To use register names with standard convension, please use MCDS_SRI1WD0_HBND.
*/
#define MCDS_SRI1WDHBND0 (MCDS_SRI1WD0_HBND)

/** \brief 7488, Comparator Range Register 0 */
#define MCDS_SRI1WD0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_RNG*)0xFA017488u)
/** Alias (User Manual Name) for MCDS_SRI1WD0_RNG.
* To use register names with standard convension, please use MCDS_SRI1WD0_RNG.
*/
#define MCDS_SRI1WDRNG0 (MCDS_SRI1WD0_RNG)

/** \brief 748C, Comparator Range Register 0 */
#define MCDS_SRI1WD0_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1WD_HRNG*)0xFA01748Cu)
/** Alias (User Manual Name) for MCDS_SRI1WD0_HRNG.
* To use register names with standard convension, please use MCDS_SRI1WD0_HRNG.
*/
#define MCDS_SRI1WDHRNG0 (MCDS_SRI1WD0_HRNG)

