HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMcds_reg.h
/** \brief 7508, Comparator Mask Register 0 */
#define MCDS_SRI1AC0_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1AC_MSK*)0xFA017508u)
/** Alias (User Manual Name) for MCDS_SRI1AC0_MSK.
* To use register names with standard convension, please use MCDS_SRI1AC0_MSK.
*/
#define MCDS_SRI1ACMSK0 (MCDS_SRI1AC0_MSK)

/** \brief 7510, Comparator Bound Register 1 */
#define MCDS_SRI1AC1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1AC_BND*)0xFA017510u)
/** Alias (User Manual Name) for MCDS_SRI1AC1_BND.
* To use register names with standard convension, please use MCDS_SRI1AC1_BND.
*/
#define MCDS_SRI1ACBND1 (MCDS_SRI1AC1_BND)

/** \brief 7514, Comparator Range Register 1 */
#define MCDS_SRI1AC1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1AC_RNG*)0xFA017514u)
/** Alias (User Manual Name) for MCDS_SRI1AC1_RNG.
* To use register names with standard convension, please use MCDS_SRI1AC1_RNG.
*/
#define MCDS_SRI1ACRNG1 (MCDS_SRI1AC1_RNG)

/** \brief 7518, Comparator Mask Register 1 */
#define MCDS_SRI1AC1_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1AC_MSK*)0xFA017518u)
/** Alias (User Manual Name) for MCDS_SRI1AC1_MSK.
* To use register names with standard convension, please use MCDS_SRI1AC1_MSK.
*/
#define MCDS_SRI1ACMSK1 (MCDS_SRI1AC1_MSK)

/** \brief 7520, Comparator Bound Register 2 */
#define MCDS_SRI1AC2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1AC_BND*)0xFA017520u)
/** Alias (User Manual Name) for MCDS_SRI1AC2_BND.
* To use register names with standard convension, please use MCDS_SRI1AC2_BND.
*/
#define MCDS_SRI1ACBND2 (MCDS_SRI1AC2_BND)

/** \brief 7524, Comparator Range Register 2 */
#define MCDS_SRI1AC2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1AC_RNG*)0xFA017524u)
/** Alias (User Manual Name) for MCDS_SRI1AC2_RNG.
* To use register names with standard convension, please use MCDS_SRI1AC2_RNG.
*/
#define MCDS_SRI1ACRNG2 (MCDS_SRI1AC2_RNG)

/** \brief 7528, Comparator Mask Register 2 */
#define MCDS_SRI1AC2_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1AC_MSK*)0xFA017528u)
/** Alias (User Manual Name) for MCDS_SRI1AC2_MSK.
* To use register names with standard convension, please use MCDS_SRI1AC2_MSK.
*/
#define MCDS_SRI1ACMSK2 (MCDS_SRI1AC2_MSK)

/** \brief 7530, Comparator Bound Register 3 */
#define MCDS_SRI1AC3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1AC_BND*)0xFA017530u)
/** Alias (User Manual Name) for MCDS_SRI1AC3_BND.
* To use register names with standard convension, please use MCDS_SRI1AC3_BND.
*/
#define MCDS_SRI1ACBND3 (MCDS_SRI1AC3_BND)

/** \brief 7534, Comparator Range Register 3 */
#define MCDS_SRI1AC3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1AC_RNG*)0xFA017534u)
/** Alias (User Manual Name) for MCDS_SRI1AC3_RNG.
* To use register names with standard convension, please use MCDS_SRI1AC3_RNG.
*/
#define MCDS_SRI1ACRNG3 (MCDS_SRI1AC3_RNG)

/** \brief 7538, Comparator Mask Register 3 */
#define MCDS_SRI1AC3_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1AC_MSK*)0xFA017538u)
/** Alias (User Manual Name) for MCDS_SRI1AC3_MSK.
* To use register names with standard convension, please use MCDS_SRI1AC3_MSK.
*/
#define MCDS_SRI1ACMSK3 (MCDS_SRI1AC3_MSK)

/** \brief 7580, DTU FIFOs Fill Level */
#define MCDS_SRI1DTUFLV /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI1DTUFLV*)0xFA017580u)

/** \brief 7600, Comparator Bound Register 0 */
#define MCDS_SRI2EA0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2EA_BND*)0xFA017600u)
/** Alias (User Manual Name) for MCDS_SRI2EA0_BND.
* To use register names with standard convension, please use MCDS_SRI2EA0_BND.
*/
#define MCDS_SRI2EABND0 (MCDS_SRI2EA0_BND)

/** \brief 7604, Comparator Range Register 0 */
#define MCDS_SRI2EA0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2EA_RNG*)0xFA017604u)
/** Alias (User Manual Name) for MCDS_SRI2EA0_RNG.
* To use register names with standard convension, please use MCDS_SRI2EA0_RNG.
*/
#define MCDS_SRI2EARNG0 (MCDS_SRI2EA0_RNG)

/** \brief 7610, Comparator Bound Register 1 */
#define MCDS_SRI2EA1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2EA_BND*)0xFA017610u)
/** Alias (User Manual Name) for MCDS_SRI2EA1_BND.
* To use register names with standard convension, please use MCDS_SRI2EA1_BND.
*/
#define MCDS_SRI2EABND1 (MCDS_SRI2EA1_BND)

/** \brief 7614, Comparator Range Register 1 */
#define MCDS_SRI2EA1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2EA_RNG*)0xFA017614u)
/** Alias (User Manual Name) for MCDS_SRI2EA1_RNG.
* To use register names with standard convension, please use MCDS_SRI2EA1_RNG.
*/
#define MCDS_SRI2EARNG1 (MCDS_SRI2EA1_RNG)

/** \brief 7620, Comparator Bound Register 2 */
#define MCDS_SRI2EA2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2EA_BND*)0xFA017620u)
/** Alias (User Manual Name) for MCDS_SRI2EA2_BND.
* To use register names with standard convension, please use MCDS_SRI2EA2_BND.
*/
#define MCDS_SRI2EABND2 (MCDS_SRI2EA2_BND)

/** \brief 7624, Comparator Range Register 2 */
#define MCDS_SRI2EA2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2EA_RNG*)0xFA017624u)
/** Alias (User Manual Name) for MCDS_SRI2EA2_RNG.
* To use register names with standard convension, please use MCDS_SRI2EA2_RNG.
*/
#define MCDS_SRI2EARNG2 (MCDS_SRI2EA2_RNG)

/** \brief 7630, Comparator Bound Register 3 */
#define MCDS_SRI2EA3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2EA_BND*)0xFA017630u)
/** Alias (User Manual Name) for MCDS_SRI2EA3_BND.
* To use register names with standard convension, please use MCDS_SRI2EA3_BND.
*/
#define MCDS_SRI2EABND3 (MCDS_SRI2EA3_BND)

/** \brief 7634, Comparator Range Register 3 */
#define MCDS_SRI2EA3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2EA_RNG*)0xFA017634u)
/** Alias (User Manual Name) for MCDS_SRI2EA3_RNG.
* To use register names with standard convension, please use MCDS_SRI2EA3_RNG.
*/
#define MCDS_SRI2EARNG3 (MCDS_SRI2EA3_RNG)

/** \brief 7680, Comparator Bound Register 0 */
#define MCDS_SRI2WD0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2WD_BND*)0xFA017680u)
/** Alias (User Manual Name) for MCDS_SRI2WD0_BND.
* To use register names with standard convension, please use MCDS_SRI2WD0_BND.
*/
#define MCDS_SRI2WDBND0 (MCDS_SRI2WD0_BND)

/** \brief 7684, Comparator Bound Register 0 */
#define MCDS_SRI2WD0_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2WD_HBND*)0xFA017684u)
/** Alias (User Manual Name) for MCDS_SRI2WD0_HBND.
* To use register names with standard convension, please use MCDS_SRI2WD0_HBND.
*/
#define MCDS_SRI2WDHBND0 (MCDS_SRI2WD0_HBND)

/** \brief 7688, Comparator Range Register 0 */
#define MCDS_SRI2WD0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2WD_RNG*)0xFA017688u)
/** Alias (User Manual Name) for MCDS_SRI2WD0_RNG.
* To use register names with standard convension, please use MCDS_SRI2WD0_RNG.
*/
#define MCDS_SRI2WDRNG0 (MCDS_SRI2WD0_RNG)

/** \brief 768C, Comparator Range Register 0 */
#define MCDS_SRI2WD0_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRI2WD_HRNG*)0xFA01768Cu)
/** Alias (User Manual Name) for MCDS_SRI2WD0_HRNG.
* To use register names with standard convension, please use MCDS_SRI2WD0_HRNG.
*/
#define MCDS_SRI2WDHRNG0 (MCDS_SRI2WD0_HRNG)

