HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMcds_reg.h
/** \brief 783C, Event Definition Register 15 */
#define MCDS_SRIEVT15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIEVT*)0xFA01783Cu)

/** \brief 7880, Action Definition Register 0 */
#define MCDS_SRIACT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIACT*)0xFA017880u)

/** \brief 7884, Action Definition Register 1 */
#define MCDS_SRIACT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIACT*)0xFA017884u)

/** \brief 7888, Action Definition Register 2 */
#define MCDS_SRIACT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIACT*)0xFA017888u)

/** \brief 788C, Action Definition Register 3 */
#define MCDS_SRIACT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIACT*)0xFA01788Cu)

/** \brief 7890, Action Definition Register 4 */
#define MCDS_SRIACT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIACT*)0xFA017890u)

/** \brief 7894, Action Definition Register 5 */
#define MCDS_SRIACT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIACT*)0xFA017894u)

/** \brief 7898, Action Definition Register 6 */
#define MCDS_SRIACT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIACT*)0xFA017898u)

/** \brief 789C, Action Definition Register 7 */
#define MCDS_SRIACT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIACT*)0xFA01789Cu)

/** \brief 78A0, Action Definition Register 8 */
#define MCDS_SRIACT8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIACT*)0xFA0178A0u)

/** \brief 78A4, Action Definition Register 9 */
#define MCDS_SRIACT9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIACT*)0xFA0178A4u)

/** \brief 78A8, Action Definition Register 10 */
#define MCDS_SRIACT10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIACT*)0xFA0178A8u)

/** \brief 78AC, Action Definition Register 11 */
#define MCDS_SRIACT11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIACT*)0xFA0178ACu)

/** \brief 78B0, Action Definition Register 12 */
#define MCDS_SRIACT12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIACT*)0xFA0178B0u)

/** \brief 78B4, Action Definition Register 13 */
#define MCDS_SRIACT13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIACT*)0xFA0178B4u)

/** \brief 78B8, Action Definition Register 14 */
#define MCDS_SRIACT14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIACT*)0xFA0178B8u)

/** \brief 78BC, Action Definition Register 15 */
#define MCDS_SRIACT15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIACT*)0xFA0178BCu)

/** \brief 78C0, Action Definition Register 16 */
#define MCDS_SRIACT16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIACT*)0xFA0178C0u)

/** \brief 78C4, Action Definition Register 17 */
#define MCDS_SRIACT17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIACT*)0xFA0178C4u)

/** \brief 78C8, Action Definition Register 18 */
#define MCDS_SRIACT18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIACT*)0xFA0178C8u)

/** \brief 78CC, Action Definition Register 19 */
#define MCDS_SRIACT19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIACT*)0xFA0178CCu)

/** \brief 78D0, Action Definition Register 20 */
#define MCDS_SRIACT20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIACT*)0xFA0178D0u)

/** \brief 78D4, Action Definition Register 21 */
#define MCDS_SRIACT21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIACT*)0xFA0178D4u)

/** \brief 78D8, Action Definition Register 22 */
#define MCDS_SRIACT22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIACT*)0xFA0178D8u)

/** \brief 78DC, Action Definition Register 23 */
#define MCDS_SRIACT23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIACT*)0xFA0178DCu)

/** \brief 78E0, Action Definition Register 24 */
#define MCDS_SRIACT24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIACT*)0xFA0178E0u)

/** \brief 78E4, Action Definition Register 25 */
#define MCDS_SRIACT25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIACT*)0xFA0178E4u)

/** \brief 78E8, Action Definition Register 26 */
#define MCDS_SRIACT26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SRIACT*)0xFA0178E8u)

/** \brief 8000, Debug Status Register */
#define MCDS_TCZDCSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZDCSTS*)0xFA018000u)

/** \brief 8004, Current Process ID */
#define MCDS_TCZCID /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZCID*)0xFA018004u)

/** \brief 8008, Current Instruction Pointer */
#define MCDS_TCZCIP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZCIP*)0xFA018008u)

/** \brief 800C, Compact Function Trace Register */
#define MCDS_TCZCFT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZCFT*)0xFA01800Cu)

/** \brief 8200, Lookup Table Data Register */
#define MCDS_TCZPALLUTD /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZPALLUTD*)0xFA018200u)

/** \brief 8204, Lookup Table Address Register */
#define MCDS_TCZPALLUTA /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZPALLUTA*)0xFA018204u)

/** \brief 8210, Lookup Table Base Register */
#define MCDS_TCZPAL0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZPAL_BND*)0xFA018210u)
/** Alias (User Manual Name) for MCDS_TCZPAL0_BND.
* To use register names with standard convension, please use MCDS_TCZPAL0_BND.
*/
#define MCDS_TCZPALBND0 (MCDS_TCZPAL0_BND)

/** \brief 8214, Lookup Table Range Register */
#define MCDS_TCZPAL0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZPAL_RNG*)0xFA018214u)
/** Alias (User Manual Name) for MCDS_TCZPAL0_RNG.
* To use register names with standard convension, please use MCDS_TCZPAL0_RNG.
*/
#define MCDS_TCZPALRNG0 (MCDS_TCZPAL0_RNG)

/** \brief 8218, Lookup Table Mapping Register */
#define MCDS_TCZPAL0_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZPAL_MAP*)0xFA018218u)
/** Alias (User Manual Name) for MCDS_TCZPAL0_MAP.
* To use register names with standard convension, please use MCDS_TCZPAL0_MAP.
*/
#define MCDS_TCZPALMAP0 (MCDS_TCZPAL0_MAP)

/** \brief 8220, Lookup Table Base Register */
#define MCDS_TCZPAL1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZPAL_BND*)0xFA018220u)
/** Alias (User Manual Name) for MCDS_TCZPAL1_BND.
* To use register names with standard convension, please use MCDS_TCZPAL1_BND.
*/
#define MCDS_TCZPALBND1 (MCDS_TCZPAL1_BND)

/** \brief 8224, Lookup Table Range Register */
#define MCDS_TCZPAL1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZPAL_RNG*)0xFA018224u)
/** Alias (User Manual Name) for MCDS_TCZPAL1_RNG.
* To use register names with standard convension, please use MCDS_TCZPAL1_RNG.
*/
#define MCDS_TCZPALRNG1 (MCDS_TCZPAL1_RNG)

/** \brief 8228, Lookup Table Mapping Register */
#define MCDS_TCZPAL1_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZPAL_MAP*)0xFA018228u)
/** Alias (User Manual Name) for MCDS_TCZPAL1_MAP.
* To use register names with standard convension, please use MCDS_TCZPAL1_MAP.
*/
#define MCDS_TCZPALMAP1 (MCDS_TCZPAL1_MAP)

