HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMcds_reg.h
/** \brief 8230, Lookup Table Base Register */
#define MCDS_TCZPAL2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZPAL_BND*)0xFA018230u)
/** Alias (User Manual Name) for MCDS_TCZPAL2_BND.
* To use register names with standard convension, please use MCDS_TCZPAL2_BND.
*/
#define MCDS_TCZPALBND2 (MCDS_TCZPAL2_BND)

/** \brief 8234, Lookup Table Range Register */
#define MCDS_TCZPAL2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZPAL_RNG*)0xFA018234u)
/** Alias (User Manual Name) for MCDS_TCZPAL2_RNG.
* To use register names with standard convension, please use MCDS_TCZPAL2_RNG.
*/
#define MCDS_TCZPALRNG2 (MCDS_TCZPAL2_RNG)

/** \brief 8238, Lookup Table Mapping Register */
#define MCDS_TCZPAL2_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZPAL_MAP*)0xFA018238u)
/** Alias (User Manual Name) for MCDS_TCZPAL2_MAP.
* To use register names with standard convension, please use MCDS_TCZPAL2_MAP.
*/
#define MCDS_TCZPALMAP2 (MCDS_TCZPAL2_MAP)

/** \brief 8240, Lookup Table Base Register */
#define MCDS_TCZPAL3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZPAL_BND*)0xFA018240u)
/** Alias (User Manual Name) for MCDS_TCZPAL3_BND.
* To use register names with standard convension, please use MCDS_TCZPAL3_BND.
*/
#define MCDS_TCZPALBND3 (MCDS_TCZPAL3_BND)

/** \brief 8244, Lookup Table Range Register */
#define MCDS_TCZPAL3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZPAL_RNG*)0xFA018244u)
/** Alias (User Manual Name) for MCDS_TCZPAL3_RNG.
* To use register names with standard convension, please use MCDS_TCZPAL3_RNG.
*/
#define MCDS_TCZPALRNG3 (MCDS_TCZPAL3_RNG)

/** \brief 8248, Lookup Table Mapping Register */
#define MCDS_TCZPAL3_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZPAL_MAP*)0xFA018248u)
/** Alias (User Manual Name) for MCDS_TCZPAL3_MAP.
* To use register names with standard convension, please use MCDS_TCZPAL3_MAP.
*/
#define MCDS_TCZPALMAP3 (MCDS_TCZPAL3_MAP)

/** \brief 8400, Comparator Bound Register 0 */
#define MCDS_TCZEA0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEA_BND*)0xFA018400u)
/** Alias (User Manual Name) for MCDS_TCZEA0_BND.
* To use register names with standard convension, please use MCDS_TCZEA0_BND.
*/
#define MCDS_TCZEABND0 (MCDS_TCZEA0_BND)

/** \brief 8404, Comparator Range Register 0 */
#define MCDS_TCZEA0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEA_RNG*)0xFA018404u)
/** Alias (User Manual Name) for MCDS_TCZEA0_RNG.
* To use register names with standard convension, please use MCDS_TCZEA0_RNG.
*/
#define MCDS_TCZEARNG0 (MCDS_TCZEA0_RNG)

/** \brief 8410, Comparator Bound Register 1 */
#define MCDS_TCZEA1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEA_BND*)0xFA018410u)
/** Alias (User Manual Name) for MCDS_TCZEA1_BND.
* To use register names with standard convension, please use MCDS_TCZEA1_BND.
*/
#define MCDS_TCZEABND1 (MCDS_TCZEA1_BND)

/** \brief 8414, Comparator Range Register 1 */
#define MCDS_TCZEA1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEA_RNG*)0xFA018414u)
/** Alias (User Manual Name) for MCDS_TCZEA1_RNG.
* To use register names with standard convension, please use MCDS_TCZEA1_RNG.
*/
#define MCDS_TCZEARNG1 (MCDS_TCZEA1_RNG)

/** \brief 8420, Comparator Bound Register 2 */
#define MCDS_TCZEA2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEA_BND*)0xFA018420u)
/** Alias (User Manual Name) for MCDS_TCZEA2_BND.
* To use register names with standard convension, please use MCDS_TCZEA2_BND.
*/
#define MCDS_TCZEABND2 (MCDS_TCZEA2_BND)

/** \brief 8424, Comparator Range Register 2 */
#define MCDS_TCZEA2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEA_RNG*)0xFA018424u)
/** Alias (User Manual Name) for MCDS_TCZEA2_RNG.
* To use register names with standard convension, please use MCDS_TCZEA2_RNG.
*/
#define MCDS_TCZEARNG2 (MCDS_TCZEA2_RNG)

/** \brief 8430, Comparator Bound Register 3 */
#define MCDS_TCZEA3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEA_BND*)0xFA018430u)
/** Alias (User Manual Name) for MCDS_TCZEA3_BND.
* To use register names with standard convension, please use MCDS_TCZEA3_BND.
*/
#define MCDS_TCZEABND3 (MCDS_TCZEA3_BND)

/** \brief 8434, Comparator Range Register 3 */
#define MCDS_TCZEA3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEA_RNG*)0xFA018434u)
/** Alias (User Manual Name) for MCDS_TCZEA3_RNG.
* To use register names with standard convension, please use MCDS_TCZEA3_RNG.
*/
#define MCDS_TCZEARNG3 (MCDS_TCZEA3_RNG)

/** \brief 8440, Comparator Bound Register 4 */
#define MCDS_TCZEA4_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEA_BND*)0xFA018440u)
/** Alias (User Manual Name) for MCDS_TCZEA4_BND.
* To use register names with standard convension, please use MCDS_TCZEA4_BND.
*/
#define MCDS_TCZEABND4 (MCDS_TCZEA4_BND)

/** \brief 8444, Comparator Range Register 4 */
#define MCDS_TCZEA4_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEA_RNG*)0xFA018444u)
/** Alias (User Manual Name) for MCDS_TCZEA4_RNG.
* To use register names with standard convension, please use MCDS_TCZEA4_RNG.
*/
#define MCDS_TCZEARNG4 (MCDS_TCZEA4_RNG)

/** \brief 8450, Comparator Bound Register 5 */
#define MCDS_TCZEA5_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEA_BND*)0xFA018450u)
/** Alias (User Manual Name) for MCDS_TCZEA5_BND.
* To use register names with standard convension, please use MCDS_TCZEA5_BND.
*/
#define MCDS_TCZEABND5 (MCDS_TCZEA5_BND)

/** \brief 8454, Comparator Range Register 5 */
#define MCDS_TCZEA5_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEA_RNG*)0xFA018454u)
/** Alias (User Manual Name) for MCDS_TCZEA5_RNG.
* To use register names with standard convension, please use MCDS_TCZEA5_RNG.
*/
#define MCDS_TCZEARNG5 (MCDS_TCZEA5_RNG)

/** \brief 8460, Comparator Bound Register 6 */
#define MCDS_TCZEA6_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZEA_BND*)0xFA018460u)
/** Alias (User Manual Name) for MCDS_TCZEA6_BND.
* To use register names with standard convension, please use MCDS_TCZEA6_BND.
*/
#define MCDS_TCZEABND6 (MCDS_TCZEA6_BND)

