HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMcds_reg.h
/** \brief 88DC, Action Definition Register 23 */
#define MCDS_TCZACT23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZACT*)0xFA0188DCu)

/** \brief 8C00, Comparator Bound Register 0 */
#define MCDS_TCZID0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZID_BND*)0xFA018C00u)
/** Alias (User Manual Name) for MCDS_TCZID0_BND.
* To use register names with standard convension, please use MCDS_TCZID0_BND.
*/
#define MCDS_TCZIDBND0 (MCDS_TCZID0_BND)

/** \brief 8C04, Comparator Range Register 0 */
#define MCDS_TCZID0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZID_RNG*)0xFA018C04u)
/** Alias (User Manual Name) for MCDS_TCZID0_RNG.
* To use register names with standard convension, please use MCDS_TCZID0_RNG.
*/
#define MCDS_TCZIDRNG0 (MCDS_TCZID0_RNG)

/** \brief 8C08, Comparator Mask Register 0 */
#define MCDS_TCZID0_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZID_MSK*)0xFA018C08u)
/** Alias (User Manual Name) for MCDS_TCZID0_MSK.
* To use register names with standard convension, please use MCDS_TCZID0_MSK.
*/
#define MCDS_TCZIDMSK0 (MCDS_TCZID0_MSK)

/** \brief 8C0C, Comparator Sign Register 0 */
#define MCDS_TCZID0_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZID_SGN*)0xFA018C0Cu)
/** Alias (User Manual Name) for MCDS_TCZID0_SGN.
* To use register names with standard convension, please use MCDS_TCZID0_SGN.
*/
#define MCDS_TCZIDSGN0 (MCDS_TCZID0_SGN)

/** \brief 8C10, Comparator Bound Register 1 */
#define MCDS_TCZID1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZID_BND*)0xFA018C10u)
/** Alias (User Manual Name) for MCDS_TCZID1_BND.
* To use register names with standard convension, please use MCDS_TCZID1_BND.
*/
#define MCDS_TCZIDBND1 (MCDS_TCZID1_BND)

/** \brief 8C14, Comparator Range Register 1 */
#define MCDS_TCZID1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZID_RNG*)0xFA018C14u)
/** Alias (User Manual Name) for MCDS_TCZID1_RNG.
* To use register names with standard convension, please use MCDS_TCZID1_RNG.
*/
#define MCDS_TCZIDRNG1 (MCDS_TCZID1_RNG)

/** \brief 8C18, Comparator Mask Register 1 */
#define MCDS_TCZID1_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZID_MSK*)0xFA018C18u)
/** Alias (User Manual Name) for MCDS_TCZID1_MSK.
* To use register names with standard convension, please use MCDS_TCZID1_MSK.
*/
#define MCDS_TCZIDMSK1 (MCDS_TCZID1_MSK)

/** \brief 8C1C, Comparator Sign Register 1 */
#define MCDS_TCZID1_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZID_SGN*)0xFA018C1Cu)
/** Alias (User Manual Name) for MCDS_TCZID1_SGN.
* To use register names with standard convension, please use MCDS_TCZID1_SGN.
*/
#define MCDS_TCZIDSGN1 (MCDS_TCZID1_SGN)

/** \brief 9000, Comparator Bound Register 0 */
#define MCDS_TCZIP0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZIP_BND*)0xFA019000u)
/** Alias (User Manual Name) for MCDS_TCZIP0_BND.
* To use register names with standard convension, please use MCDS_TCZIP0_BND.
*/
#define MCDS_TCZIPBND0 (MCDS_TCZIP0_BND)

/** \brief 9004, Comparator Range Register 0 */
#define MCDS_TCZIP0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZIP_RNG*)0xFA019004u)
/** Alias (User Manual Name) for MCDS_TCZIP0_RNG.
* To use register names with standard convension, please use MCDS_TCZIP0_RNG.
*/
#define MCDS_TCZIPRNG0 (MCDS_TCZIP0_RNG)

/** \brief 9010, Comparator Bound Register 1 */
#define MCDS_TCZIP1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZIP_BND*)0xFA019010u)
/** Alias (User Manual Name) for MCDS_TCZIP1_BND.
* To use register names with standard convension, please use MCDS_TCZIP1_BND.
*/
#define MCDS_TCZIPBND1 (MCDS_TCZIP1_BND)

/** \brief 9014, Comparator Range Register 1 */
#define MCDS_TCZIP1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZIP_RNG*)0xFA019014u)
/** Alias (User Manual Name) for MCDS_TCZIP1_RNG.
* To use register names with standard convension, please use MCDS_TCZIP1_RNG.
*/
#define MCDS_TCZIPRNG1 (MCDS_TCZIP1_RNG)

/** \brief 9020, Comparator Bound Register 2 */
#define MCDS_TCZIP2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZIP_BND*)0xFA019020u)
/** Alias (User Manual Name) for MCDS_TCZIP2_BND.
* To use register names with standard convension, please use MCDS_TCZIP2_BND.
*/
#define MCDS_TCZIPBND2 (MCDS_TCZIP2_BND)

/** \brief 9024, Comparator Range Register 2 */
#define MCDS_TCZIP2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZIP_RNG*)0xFA019024u)
/** Alias (User Manual Name) for MCDS_TCZIP2_RNG.
* To use register names with standard convension, please use MCDS_TCZIP2_RNG.
*/
#define MCDS_TCZIPRNG2 (MCDS_TCZIP2_RNG)

/** \brief 9030, Comparator Bound Register 3 */
#define MCDS_TCZIP3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZIP_BND*)0xFA019030u)
/** Alias (User Manual Name) for MCDS_TCZIP3_BND.
* To use register names with standard convension, please use MCDS_TCZIP3_BND.
*/
#define MCDS_TCZIPBND3 (MCDS_TCZIP3_BND)

/** \brief 9034, Comparator Range Register 3 */
#define MCDS_TCZIP3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZIP_RNG*)0xFA019034u)
/** Alias (User Manual Name) for MCDS_TCZIP3_RNG.
* To use register names with standard convension, please use MCDS_TCZIP3_RNG.
*/
#define MCDS_TCZIPRNG3 (MCDS_TCZIP3_RNG)

/** \brief 9040, Comparator Bound Register 4 */
#define MCDS_TCZIP4_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZIP_BND*)0xFA019040u)
/** Alias (User Manual Name) for MCDS_TCZIP4_BND.
* To use register names with standard convension, please use MCDS_TCZIP4_BND.
*/
#define MCDS_TCZIPBND4 (MCDS_TCZIP4_BND)

/** \brief 9044, Comparator Range Register 4 */
#define MCDS_TCZIP4_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZIP_RNG*)0xFA019044u)
/** Alias (User Manual Name) for MCDS_TCZIP4_RNG.
* To use register names with standard convension, please use MCDS_TCZIP4_RNG.
*/
#define MCDS_TCZIPRNG4 (MCDS_TCZIP4_RNG)

/** \brief 9050, Comparator Bound Register 5 */
#define MCDS_TCZIP5_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZIP_BND*)0xFA019050u)
/** Alias (User Manual Name) for MCDS_TCZIP5_BND.
* To use register names with standard convension, please use MCDS_TCZIP5_BND.
*/
#define MCDS_TCZIPBND5 (MCDS_TCZIP5_BND)

/** \brief 9054, Comparator Range Register 5 */
#define MCDS_TCZIP5_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCZIP_RNG*)0xFA019054u)
/** Alias (User Manual Name) for MCDS_TCZIP5_RNG.
* To use register names with standard convension, please use MCDS_TCZIP5_RNG.
*/
#define MCDS_TCZIPRNG5 (MCDS_TCZIP5_RNG)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXMCDS_REG_H */
